[
    {
        "id": 126910,
        "executor_type": "THIRDPARTY",
        "executor_name": "getnews",
        "executor_version": "v2",
        "executor_display_name": "Get News",
        "executor_description": "Get News",
        "executor_category": "SearchNews",
        "executor_category_group": "SearchNews",
        "service_provider": "newscatcher",
        "executor_scope": null,
        "partner": "b2b",
        "account_id": "b2b",
        "executor_method_type": "POST",
        "apiUrl": "https://api.newscatcherapi.com/v2/search",
        "dataroot": null,
        "pathParams": [],
        "queryParams": [
            {
                "key": "q",
                "value": "",
                "description": "Keyword/keywords you're searching for. This is the most important part of your query.   You can set this to '*' if you don't want to look for specific keywords.   Please, refer to the Advanced Query Parameter section below for more examples and explanations.",
                "req": false
            },
            {
                "key": "lang",
                "value": "",
                "description": "Specifies the languages of the search. For example,  en .  The only accepted format is ISO 639-1 — 2 letter code.  Refer to the language format section below for more details.",
                "req": false
            },
            {
                "key": "not_lang",
                "value": "",
                "description": "Inverse to the  lang  parameter",
                "req": false
            },
            {
                "key": "published_date_precision",
                "value": "",
                "description": "There are 3 types of date precision we define:   full  — day and time of an article is correctly identified with the appropriate timezone   timezone unknown  — day and time of an article is correctly identified without timezone   date  — only the day is identified without an exact time",
                "req": false
            },
            {
                "key": "search_in",
                "value": "",
                "description": "By default, we search what you specified in the  q  parameter in both  title  and  summary  of the article.   However, you can limit this to either  title  or  summary",
                "req": false
            },
            {
                "key": "countries",
                "value": "",
                "description": "Countries where the news publisher is located.  Important: This parameter is not responsible for the countries mentioned in the news article.  One or multiple countries can be used in the search.  The only acceptable format is ISO 3166-1 alpha-2  For example,  US,CA,MX  or just  US",
                "req": false
            },
            {
                "key": "not_countries",
                "value": "",
                "description": "The inverse of the  countries  parameter.",
                "req": false
            },
            {
                "key": "topic",
                "value": "",
                "description": "Accepted values:  news ,  sport , tech ,  world ,  finance , politics ,  business ,  economics ,  entertainment ,  beauty ,  travel ,  music ,  food ,  science ,  gaming ,  energy . The topic to which you want to restrict the articles of your choice.  Not all news articles are assigned with a topic, therefore, we cannot guarantee that 100% of topics talking about technology will be assigned a tech label.",
                "req": false
            },
            {
                "key": "sources",
                "value": "",
                "description": "One or more news resources to filter your search. It should be the normal form of the URL,  For example,  nytimes.com,theguardian.com",
                "req": false
            },
            {
                "key": "not_sources",
                "value": "",
                "description": "One or more sources to be excluded from the search.   Comma-separated list. For example,  cnn.com,wsj.com",
                "req": false
            },
            {
                "key": "ranked_only",
                "value": "",
                "description": "Default:  True   Limit the search only for the sources which are in the top 1 million online websites. Unranked sources are assigned a rank that equals   999999",
                "req": false
            },
            {
                "key": "from_rank",
                "value": "",
                "description": "[0:999999]  The lowest boundary of the rank of a news website to filter by.   Important: lower rank means that a source is more popular",
                "req": false
            },
            {
                "key": "to_rank",
                "value": "",
                "description": "[0:999999]  The upper boundary of the rank of a news website to filter by.",
                "req": false
            },
            {
                "key": "sort_by",
                "value": "",
                "description": "relevancy  (default value) — the most relevant results first   date  — the most recently published results first   rank  — the results from the highest-ranked sources first",
                "req": false
            },
            {
                "key": "page_size",
                "value": "",
                "description": "[1:100]  How many articles to return per page.",
                "req": false
            },
            {
                "key": "page",
                "value": "",
                "description": "The number of the page. Use it to scroll through the results.   This parameter is used to paginate: scroll through results because one API response cannot return more than 100 articles.",
                "req": false
            },
            {
                "key": "to",
                "value": "",
                "description": "Until which point in time to search for. The default timezone is UTC.   Availabe formats :  YYYY/mm/dd    YYYY/mm/dd HH:MM:SS     English phrases like 1 day ago",
                "req": false
            },
            {
                "key": "from",
                "value": "",
                "description": "From which point in time to start the search. Defaults to the past week.  Availabe formats :  YYYY/mm/dd   YYYY/mm/dd HH:MM:SS    English phrases like  1 day ago  ",
                "req": false
            }
        ],
        "headers": [
            {
                "key": "x-api-key",
                "value": "",
                "description": "Your unique authentication token",
                "req": false
            },
            {
                "key": "Content-Type",
                "value": "application/json",
                "description": "",
                "req": false
            }
        ],
        "authModel": {
            "authType": "api_key",
            "authAttributes": {}
        },
        "requestBody": {
            "value": {
                "status": "ok",
                "total_hits": 7471,
                "page": 1,
                "total_pages": 7471,
                "page_size": 1,
                "articles": [
                    {
                        "title": "Is an Apple Music Subscription Worth It?",
                        "author": "Shujaa Imran",
                        "published_date": "2022-02-03 16:53:12",
                        "published_date_precision": "full",
                        "link": "https://www.makeuseof.com/apple-music-subscription-worth-it",
                        "clean_url": "makeuseof.com",
                        "excerpt": "Thinking of subscribing to Apple Music? Here's how to know if it's worth it for you.",
                        "summary": "Since its launch in June 2015, Apple Music has been growing steadily. Because of its easy integration across Apple devices, many Apple users are fond of the streaming service. However, how does Apple Music stack up compared to the other streaming services out there? Does it justify a $9.99 subscription per month? We'll break down all the details for you, so you can decide whether an Apple Music subscription is truly worth it. What Is Apple Music?\nApple Music is the Apple's music streaming service, which allows subscribers to access millions of content for a subscription fee. With over 90 million songs, Apple Music content can either be streamed online or downloaded to your device for offline listening. \n\nConsidering Apple was late to the streaming market, its music streaming service has performed well. While Apple hasn't released any official figures, reports say that Apple Music had over 523 million subscribers by the end of 2021.\nAccording to Midia Research, Apple Music achieved a market share of 15% in 2021. In comparison, Spotify came at first place and captured 31% of the global streaming market in the same year. An Apple Music subscription combines subscription-based music streaming with global radio-like programming. With this, purchasing a subscription doesn't just unlock Apple Music's extensive 90-million song library for you to use. Apple Music also lets you watch music videos without ads, access a few podcasts, listen to its curated playlists, and tune into Apple Music's radio stations.\nApple's main radio offering, Apple Music 1, features an around-the-clock worldwide live broadcast from DJs based in Los Angeles, New York, and London. Other radio stations include Apple Music Hits, which play everyone's favorite songs from the '80s, '90s, and 2000s, and Apple Music Country, which features country music. Which Devices Does Apple Music Work on?\nApple Music is primarily available in the Music app on all iPhones, iPads, and iPod Touch models running iOS 8.4 or later. Aside from this, Apple Music is also available on PC (iTunes app), Mac (Music app), Apple TV, and Apple Watch. Apple Music is also available on non-Apple devices, such as Android phones, smart TVs, streaming boxes, and even game consoles. Alternatively, you can also access Apple Music online at music.apple.com.\nWhen using Apple Music, you can choose to either stream everything directly from the internet or download it onto your device for offline listening. If you're concerned about data usage, or you'll mostly be in an area without a good wireless connection, offline listening is a great feature. However, it could be an issue if you're already running low on storage space on your device.\nSimilar to other streaming services, you don't own the music files downloaded from Apple Music. With this, you won't be able to offload them anywhere else, burn them onto a disk, or use them in separate video projects. So, if you decide to cancel your Apple Music subscription, you'll lose access to your library. The Benefits of Apple Music\nApple Music works across different platforms including Android. However, its primary advantage is that it's integrated into Apple's ecosystem—meaning you can easily listen to your collection on your iPhone, iPad, Mac, and even Apple Watch.\nIn addition, Apple Music also features high-quality audio playback for audiophiles. For those who enjoy quality streaming, Apple Music offers Lossless, Hi-Res Lossless, Dolby Atmos, and Spatial Audio content, which arrived in June 2021.\nApart from your personal music library, Apple Music can help you enhance your collection with a mix of old and new tracks, along with Apple Music's three live radio stations. You can also stream TV shows, podcasts, music videos, and over 30,000 expertly curated playlists. The Drawbacks of Apple Music\nApple Music's main competitor, Spotify, also offers a robust streaming experience. A key drawback of Apple Music is that it doesn't offer a free version, whereas Spotify does, albeit with ads. Comparatively, Spotify also has a more extensive library than Apple Music, and offers better social media integration. Although, Apple Music still has better integration with the Apple ecosystem, and its content library is increasing every day.\nWhile Apple Music also includes podcasts, they're few and far in between. So, if you're looking for a way to listen to podcasts, Apple Podcasts has a much bigger and organized library. How Much Does Apple Music Cost?\nDepending on your needs, Apple Music operates as a subscription-based service and has different plans available. The basic monthly subscription is $10, which is the same as Spotify Premium and Tidal HiFi.\nAlternatively, you can pay an annual fee of $99. Other plans include a student subscription for $5 per month and a family plan that can be shared between six people for $15 per month. Apple also offers the Apple Music Voice Plan, which is available for $5 per month. The catch—you can only use Siri to verbally request songs, and the service is streaming only. With Apple Music Voice Plan, you can't use the app, download songs, use the Lyrics view, or access Apple's full Lossless audio and Dolby Atmos catalog. Does Apple Music Offer a Free Trial?\nUsually, Apple Music offers a 3-month trial for users looking to try out the subscription, after which it reverts to $9.99 per month. However, while there is no way to use Apple Music for free forever, there are a ton of ways to get it free for longer.\nWith free trials, you can choose to try out the service before you commit to a subscription. If you're not sold on Apple Music, you can simply cancel the trial before it expires. Gone are the times of playing music using CDs—digital music streaming is the new thing. While there are multiple streaming services to pick from, there's no doubt that Apple Music is worth considering.\nIf you own an Apple device, and you're actively looking to get a subscription for your music needs, we'd recommend giving Apple Music a try. In true Apple fashion, Apple Music makes things much easier for a variety of reasons. However, once you get tied into the ecosystem, it can become difficult to escape from. \n How to Get Started Using Apple Music Playlists In this article, we explore how to create, populate, share, discover, and become a master of Apple Music playlists. Related Topics Entertainment IPhone Media Streaming Apple Apple Music \n About The Author Shujaa Imran (54 Articles Published) More From Shujaa Imran Join our newsletter for tech tips, reviews, free ebooks, and exclusive deals!",
                        "rights": "makeuseof.com",
                        "rank": 1729,
                        "topic": "news",
                        "country": "CA",
                        "language": "en",
                        "authors": [
                            "Shujaa Imran"
                        ],
                        "media": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2022/02/thomas-kolnowski-uY-9Dyz8PPM-unsplash-2-1.jpg",
                        "is_opinion": false,
                        "twitter_account": "@MUO_official",
                        "_score": 11.035287,
                        "_id": "1017cfad154df78ba22b6b358d672e1f"
                    }
                ],
                "user_input": {
                    "q": "Apple",
                    "search_in": [
                        "title_summary"
                    ],
                    "lang": null,
                    "not_lang": null,
                    "countries": [
                        "CA"
                    ],
                    "not_countries": null,
                    "from": "2021-12-15 00:00:00",
                    "to": null,
                    "ranked_only": "True",
                    "from_rank": null,
                    "to_rank": null,
                    "sort_by": "relevancy",
                    "page": 1,
                    "size": 1,
                    "sources": null,
                    "not_sources": null,
                    "topic": null,
                    "published_date_precision": null
                }
            },
            "key": "payload",
            "description": "Document in JSON format",
            "annotation": "RequestBody"
        },
        "prerequisites": null,
        "executors": null,
        "functions": null,
        "responseAttributes": [
            {
                "attributeName": null,
                "displayName": null,
                "description": null,
                "type": null,
                "size": 0,
                "precision": 0,
                "autoIncrement": false,
                "defaultValue": null,
                "subType": [],
                "attributeType": "None",
                "required": false,
                "dataStoragePolicy": "None",
                "apiAccessPolicy": "None",
                "displayPolicy": "None",
                "array": false,
                "customType": false,
                "updateOption": null,
                "previousAttributeName": null,
                "compliances": null
            }
        ],
        "response": null,
        "attributeMappings": null,
        "source": null,
        "block_attributes": null,
        "workflow_credentials": null,
        "disabled": false,
        "published": true,
        "scopeOfAccess": "public",
        "registeredAsIs": true,
        "creationTime": 1712298879197,
        "lastModifiedTime": 1712298879197,
        "executionLib": null,
        "isDocumentationPublished": true,
        "mockResponses": [
            {
                "statusCode": 200,
                "name": null,
                "statusText": null,
                "methodType": "GET",
                "message": "Success",
                "description": null,
                "headers": [
                    {
                        "name": "Content-Type",
                        "value": "application/json"
                    }
                ],
                "cookies": null,
                "responseAttributes": [],
                "sampleData": {
                    "status": "ok",
                    "total_hits": 10000,
                    "page": 1,
                    "total_pages": 5000,
                    "page_size": 2,
                    "articles": [
                        {
                            "title": "ARK reduziert Anteile: Cathie Wood wirft Tesla-Aktien aus dem Depot",
                            "author": null,
                            "published_date": "2021-08-04 01:15:00",
                            "published_date_precision": "full",
                            "link": "https://www.finanzen.net/nachricht/aktien/beteiligung-reduziert-ark-reduziert-anteile-cathie-wood-wirft-tesla-aktien-aus-dem-depot-10402608",
                            "clean_url": "finanzen.net",
                            "excerpt": "• ARK Invest verkauft Tesla-Anteile im Wert von 43,7 Millionen US-Dollar • Tesla-Aktie bleibt Top-Holding in drei ETFs • Cathie Wood sieht Tesla-Aktie falsch ...",
                            "summary": "• ARK Invest verkauft Tesla-Anteile im Wert von 43,7 Millionen US-Dollar• Tesla-Aktie bleibt Top-Holding in drei ETFs• Cathie Wood sieht Tesla-Aktie falsch bewertet Die starke Entwicklung der Tesla-Aktie im Jahr 2020 war einer der Hauptwachstumstreiber in den ETFs der Investmentfirma ARK Invest. Im April hatte das Unternehmen bei einem Aktienpreis von rund 719 US-Dollar dann zuletzt einige Tesla-Aktien aus dem Depot geworfen, jetzt war es erneut soweit. Tesla-Aktien verkauft: 43,7 Millionen US-Dollar eingenommen ARK veräußerte 63.643 Tesla-Aktien und hat bei dem Verkauf 43,7 Millionen US-Dollar eingenommen, das geht aus dem Trading-Update des Unternehmens hervor. Tesla ist die Top-Holding im Flaggschiff ETF ARK Innovation und ist ebenfalls die größte Beteiligung in zwei weiteren ARK-ETFs: Dem Ark Autonomous Technology & Robotics ETF und dem Ark Next Generation Internet ETF. Insgesamt befinden sich nun noch 4.873.916 Tesla-Aktien in den ETFs von ARK Invest, der Gesamtwert des Investments belief sich zuletzt auf rund 3,3 Milliarden US-Dollar. Tesla von falschen Analysten falsch bewertet Dass der Teil-Verkauf von Tesla-Aktien den Langzeit-Bullen Wood an dem Elektroautobauer zweifeln lässt, ist allerdings nicht anzunehmen. Noch vor Veröffentlichung der Quartalsbilanz von Tesla hatte Wood in einem Interview ihr Basis-Kursziel von 3.000 US-Dollar für die Tesla-Aktie bestätigt. Gegenüber \"Real Vision\" nahm die Investorin dabei auch Tesla-Analysten ins Visier, die ihrer Meinung nach mit dafür verantwortlich sind, dass Tesla am Markt falsch bewertet wird: \"Wir glauben, dass der Grund für eine so große Ineffizienz bei Teslas Bewertung der kurzfristige Zeithorizont der Analysten ist und die Tatsache, dass die falschen Analysten folgen\". Sie betonte, dass Tesla mehrheitlich von Auto-Analysten bewertet werde, dabei sei der Konzern von Elon Musk ein \"facettenreiches Technologieunternehmen\". Bei ARK hab man eine andere Herangehensweise, um die Aktie von Tesla korrekt bewerten zu können: \"Tesla ist ein Technologieunternehmen, aber nicht nur ein Technologieunternehmen\", sagte sie und nannte in dem Zusammenhang auch Energiespeicher, Robotik, künstliche Intelligenz und Software-as-a-Service. \"Wir haben also drei Analysten, die das Tesla-Modell zusammenbauen\", erklärte sie. ARK investiert in Innovation Die Investmentgesellschaft der Starinvestorin hat sich vorrangig auf die Marktsegmente Digitalisierung und Technologie konzentriert und das Portfolio ihrer ETFs konsequent darauf ausgerichtet. Der Fokus hat dafür gesorgt, dass ARK in den vergangenen Jahren eine starke Rendite erwirtschaften konnte und im vergangenen Jahr auch Investorenlegende Warren Buffett und seiner Holding Berkshire Hathaway den Rang abgelaufen hatte.",
                            "rights": "klamm.de",
                            "rank": 7420,
                            "topic": "news",
                            "country": "unknown",
                            "language": "de",
                            "authors": [],
                            "media": "https://static.klamm.de/news/news-img-k.jpg",
                            "is_opinion": false,
                            "twitter_account": null,
                            "_score": 13.178295,
                            "_id": "e3c5e3a88c985a015b6051812198670d"
                        },
                        {
                            "title": "How much does a Tesla weigh? Comparing each model",
                            "author": "Scooter Doll",
                            "published_date": "2021-08-02 08:23:00",
                            "published_date_precision": "full",
                            "link": "https://electrek.co/2021/08/02/how-much-does-a-tesla-weigh-comparing-each-model",
                            "clean_url": "electrek.co",
                            "excerpt": "When learning more about Tesla and its growing fleet of EVs, consumers new to the market have a lot of the same questions. Inquiries such as How much does a Tesla cost? How long does it take to charge a Tesla? How much does it cost to charge a Tesla? Believe it or not, one of the most frequent questions we receive in addition to those above is, How much does a Tesla weigh? \nWhile this question is more easily answered than others, there are a few factors that play a role in the weight of each Tesla model. Here's everything you need to know broken down by model.\n more…\nThe post How much does a Tesla weigh? Comparing each model appeared first on Electrek.",
                            "summary": "When learning more about Tesla and its growing fleet of EVs, consumers new to the market have a lot of the same questions. Inquiries such as How much does a Tesla cost? How long does it take to charge a Tesla? How much does it cost to charge a Tesla? Believe it or not, one of the most frequent questions we receive in addition to those above is, How much does a Tesla weigh?\n\nWhile this question is more easily answered than others, there are a few factors that play a role in the weight of each Tesla model. Here's everything you need to know broken down by model.\n\nHow much does each Tesla weigh?\n\nUnfortunately, your Tesla does not get an annual physical where a doctor can check in on your EV's weight, and there aren't too many vehicle-sized scales easily accessible to drivers.\n\nLuckily, Tesla has provided the weights of most of its vehicles, but they're still are varying factors.\n\nAside from different model types, some Teslas can vary in weight based on their trim or powertrain. Electric motors aren't as heavy ICE engine blocks, but they do carry some weight around.\n\nThat being said, more performance means more electric motors, and more motors mean additional weight.\n\nThe size and cargo space of the Tesla itself is also a pretty obvious factor, as a Model X will certainly weigh more than a Model 3 — and pretty much any other Tesla at this point.\n\nBelow is each Tesla's weight according to the American automaker, sorted by chronological debut.\n\nTesla's original Roadster EV\n\nTesla Roadster\n\nTesla's flagship EV remains its lightest model to date. The original Tesla Roadster sits as a limited-run EV and is now a collector's item for some, so its weight has not changed in the decade it's been around.\n\nThe first-generation Roadster weighs in at 2,723 lbs.\n\nModel S\n\nThe second oldest Tesla model on our list and the longest currently in production is the Model S sedan. After seeing a refresh earlier in 2021 that will eventually bring the tri-motor Plaid powertrain to drivers, the Model S can come with some weight.\n\nThe dual-motor Long Range trim, which has now been delayed to 2022, weighs 4,561 lbs.\n\nThe tri-motor Plaid Model S will weigh in at 4,766 lbs. when it (hopefully) delivers this fall.\n\nModel X\n\nThe largest current Tesla is unsurprisingly also the heaviest to date (we're still waiting on you, Cybertruck).\n\nCurrently available in two different trims, both the Long Range and new Plaid Model X weigh more than any of their Tesla siblings.\n\nThe Model X Long Range weighs 5,185 lbs., while the Plaid Model X and its three motors will weigh 5,390 lbs. Both trims are currently scheduled to arrive in the first quarter of 2022 alongside the Long Range Model S.\n\nModel 3\n\nThe cheapest Tesla available is also one of the very lightest, no matter the powertrain you choose. The Tesla Model 3 is currently available in three trims:\n\nThe single motor Model 3 Standard Range Plus is the second-lightest Tesla ever at 3,582 lbs.\n\nThe other two dual-motor Model 3 trims, Long Range and Performance, both weigh in at 4,065 lbs.\n\nModel Y\n\nThe newest Tesla to arrive currently sits in the middle of the pack on weight, which sits on brand with its pricing and performance as well.\n\nThe Tesla Model Y is currently available in either a Long Range or Performance dual-motor trim, and each weighs 4,416 lbs.\n\nWhat is the heaviest Tesla?\n\nIf you've skimmed through to this point, you must just be looking for weights and an answer to the question above without all the jibber-jabber. We respect that, so here you go.\n\nHere are all of Tesla's current models sorted heaviest to lightest:\n\n5,390 lbs – Model X Plaid\n\n5,185 lbs – Model X Long Range\n\n4,766 lbs – Model S Plaid\n\n4,561 lbs – Model S Long Range\n\n4,416 lbs – Model Y Long Range/Performance\n\n4,065 lbs – Model 3 Long Range/Performance\n\n3,582 lbs – Model 3 Standard Range Plus\n\n2,723 lbs Gen. 1 Tesla Roadster\n\nHow much does Tesla Cybertruck weigh?\n\nUnfortunately, we do not have that granular of specs on the upcoming Tesla Cybertruck yet, although we have asked Tesla several times.\n\nBased on the increased size and payload capacity (at least 3,500 lbs) compared to the current largest Tesla in the Model X, we anticipate the weight of the three upcoming powertrains on the Cybertruck to be between 5,000 and 6,500 lbs.\n\nThat being said, towing capacities up to 14,000 lbs., like Tesla is advertising for the tri-motor Cybertruck, could very well require more weight beyond 6,500 lbs.\n\nCheck back in with our Cybertruck guide periodically for the latest specs from Tesla.\n\nHow much does the 2nd generation Tesla Roadster weigh?\n\nMuch like the Cybertruck, Tesla has not yet revealed what the second-generation Roadster will tip the scales at when it debuts in 2022.\n\nBased on its size and touted performance, complete with new motors, we'd expect the new Roadster to land somewhere near the upcoming Model S trims, perhaps between 4,400 and 4,700 lbs.\n\nWe will know for certain when Tesla shares more details of the Gen. 2 Roadster… like whether it can actually hover or not.\n\nFTC: We use income earning auto affiliate links. More.\n\nSubscribe to Electrek on YouTube for exclusive videos and subscribe to the podcast.",
                            "rights": "electrek.co",
                            "rank": 3297,
                            "topic": "news",
                            "country": "US",
                            "language": "en",
                            "authors": [
                                "Scooter Doll"
                            ],
                            "media": "https://i1.wp.com/electrek.co/wp-content/uploads/sites/3/2021/08/Tesla-on-a-scale.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
                            "is_opinion": false,
                            "twitter_account": "@electrekco",
                            "_score": 13.09692,
                            "_id": "b9a2f7cabf9255d7e9ec19c6dc65018d"
                        }
                    ],
                    "user_input": {
                        "q": "Tesla",
                        "search_in": [
                            "title",
                            "summary"
                        ],
                        "lang": null,
                        "not_lang": null,
                        "countries": null,
                        "not_countries": null,
                        "from": "2021-08-02 00:00:00",
                        "to": null,
                        "ranked_only": "True",
                        "from_rank": null,
                        "to_rank": null,
                        "sort_by": "relevancy",
                        "page": 1,
                        "size": 2,
                        "sources": null,
                        "not_sources": null,
                        "topic": null,
                        "published_date_precision": null
                    }
                }
            },
            {
                "statusCode": 400,
                "name": null,
                "statusText": null,
                "methodType": "GET",
                "message": null,
                "description": null,
                "headers": [
                    {
                        "name": "Content-Type",
                        "value": "application/json"
                    }
                ],
                "cookies": null,
                "responseAttributes": [],
                "sampleData": {
                    "status": "error",
                    "error_code": "HeadersWithoutKey",
                    "message": "No API key was given. Please provide an API key and put it into headers, like 'x-api-key': 'YOUR_API_KEY'"
                }
            }
        ],
        "isMockResponseEnabled": false,
        "block_id": null,
        "gatewaySettings": null,
        "apiQueryModel": null,
        "properties": null,
        "vid": null,
        "nid": null
    },
    {
        "id": 126909,
        "executor_type": "THIRDPARTY",
        "executor_name": "getNews",
        "executor_version": "v2",
        "executor_display_name": "Get News",
        "executor_description": "Main endpoint that allows you to find news article by keyword, date, language, country, etc.",
        "executor_category": "SearchNews",
        "executor_category_group": "SearchNews",
        "service_provider": "newscatcher",
        "executor_scope": null,
        "partner": "b2b",
        "account_id": "b2b",
        "executor_method_type": "GET",
        "apiUrl": "https://api.newscatcherapi.com/v2/search",
        "dataroot": null,
        "pathParams": [],
        "queryParams": [
            {
                "key": "q",
                "value": "",
                "description": "Keyword/keywords you're searching for. This is the most important part of your query.   You can set this to '*' if you don't want to look for specific keywords.   Please, refer to the Advanced Query Parameter section below for more examples and explanations.",
                "req": false
            },
            {
                "key": "lang",
                "value": "",
                "description": "Specifies the languages of the search. For example,  en .  The only accepted format is ISO 639-1 — 2 letter code.  Refer to the language format section below for more details.",
                "req": false
            },
            {
                "key": "not_lang",
                "value": "",
                "description": "Inverse to the  lang  parameter",
                "req": false
            },
            {
                "key": "published_date_precision",
                "value": "",
                "description": "There are 3 types of date precision we define:   full  — day and time of an article is correctly identified with the appropriate timezone   timezone unknown  — day and time of an article is correctly identified without timezone   date  — only the day is identified without an exact time",
                "req": false
            },
            {
                "key": "search_in",
                "value": "",
                "description": "By default, we search what you specified in the  q  parameter in both  title  and  summary  of the article.   However, you can limit this to either  title  or  summary",
                "req": false
            },
            {
                "key": "countries",
                "value": "",
                "description": "Countries where the news publisher is located.  Important: This parameter is not responsible for the countries mentioned in the news article.  One or multiple countries can be used in the search.  The only acceptable format is ISO 3166-1 alpha-2  For example,  US,CA,MX  or just  US",
                "req": false
            },
            {
                "key": "not_countries",
                "value": "",
                "description": "The inverse of the  countries  parameter.",
                "req": false
            },
            {
                "key": "topic",
                "value": "",
                "description": "Accepted values:  news ,  sport , tech ,  world ,  finance , politics ,  business ,  economics ,  entertainment ,  beauty ,  travel ,  music ,  food ,  science ,  gaming ,  energy . The topic to which you want to restrict the articles of your choice.  Not all news articles are assigned with a topic, therefore, we cannot guarantee that 100% of topics talking about technology will be assigned a tech label.",
                "req": false
            },
            {
                "key": "sources",
                "value": "",
                "description": "One or more news resources to filter your search. It should be the normal form of the URL,  For example,  nytimes.com,theguardian.com",
                "req": false
            },
            {
                "key": "not_sources",
                "value": "",
                "description": "One or more sources to be excluded from the search.   Comma-separated list. For example,  cnn.com,wsj.com",
                "req": false
            },
            {
                "key": "ranked_only",
                "value": "",
                "description": "Default:  True   Limit the search only for the sources which are in the top 1 million online websites. Unranked sources are assigned a rank that equals   999999",
                "req": false
            },
            {
                "key": "from_rank",
                "value": "",
                "description": "[0:999999]  The lowest boundary of the rank of a news website to filter by.   Important: lower rank means that a source is more popular",
                "req": false
            },
            {
                "key": "to_rank",
                "value": "",
                "description": "[0:999999]  The upper boundary of the rank of a news website to filter by.",
                "req": false
            },
            {
                "key": "sort_by",
                "value": "",
                "description": "relevancy  (default value) — the most relevant results first   date  — the most recently published results first   rank  — the results from the highest-ranked sources first",
                "req": false
            },
            {
                "key": "page_size",
                "value": "",
                "description": "[1:100]  How many articles to return per page.",
                "req": false
            },
            {
                "key": "page",
                "value": "",
                "description": "The number of the page. Use it to scroll through the results.   This parameter is used to paginate: scroll through results because one API response cannot return more than 100 articles.",
                "req": false
            },
            {
                "key": "to",
                "value": "",
                "description": "Until which point in time to search for. The default timezone is UTC.   Availabe formats :  YYYY/mm/dd    YYYY/mm/dd HH:MM:SS     English phrases like 1 day ago",
                "req": false
            },
            {
                "key": "from",
                "value": "",
                "description": "From which point in time to start the search. Defaults to the past week.  Availabe formats :  YYYY/mm/dd   YYYY/mm/dd HH:MM:SS    English phrases like  1 day ago  ",
                "req": false
            }
        ],
        "headers": [
            {
                "key": "x-api-key",
                "value": "",
                "description": "Your unique authentication token",
                "req": false
            }
        ],
        "authModel": {
            "authType": "api_key",
            "authAttributes": {}
        },
        "requestBody": {
            "value": "",
            "key": "payload",
            "description": "Document in JSON format",
            "annotation": "RequestBody"
        },
        "prerequisites": null,
        "executors": null,
        "functions": null,
        "responseAttributes": [
            {
                "attributeName": null,
                "displayName": null,
                "description": null,
                "type": null,
                "size": 0,
                "precision": 0,
                "autoIncrement": false,
                "defaultValue": null,
                "subType": [],
                "attributeType": "None",
                "required": false,
                "dataStoragePolicy": "None",
                "apiAccessPolicy": "None",
                "displayPolicy": "None",
                "array": false,
                "customType": false,
                "updateOption": null,
                "previousAttributeName": null,
                "compliances": null
            }
        ],
        "response": null,
        "attributeMappings": null,
        "source": null,
        "block_attributes": null,
        "workflow_credentials": null,
        "disabled": false,
        "published": true,
        "scopeOfAccess": "public",
        "registeredAsIs": true,
        "creationTime": 1712298604820,
        "lastModifiedTime": 1712298604820,
        "executionLib": null,
        "isDocumentationPublished": true,
        "mockResponses": [
            {
                "statusCode": 200,
                "name": null,
                "statusText": null,
                "methodType": "GET",
                "message": "Success",
                "description": null,
                "headers": [
                    {
                        "name": "Content-Type",
                        "value": "application/json"
                    }
                ],
                "cookies": null,
                "responseAttributes": [],
                "sampleData": {
                    "status": "ok",
                    "total_hits": 10000,
                    "page": 1,
                    "total_pages": 5000,
                    "page_size": 2,
                    "articles": [
                        {
                            "title": "ARK reduziert Anteile: Cathie Wood wirft Tesla-Aktien aus dem Depot",
                            "author": null,
                            "published_date": "2021-08-04 01:15:00",
                            "published_date_precision": "full",
                            "link": "https://www.finanzen.net/nachricht/aktien/beteiligung-reduziert-ark-reduziert-anteile-cathie-wood-wirft-tesla-aktien-aus-dem-depot-10402608",
                            "clean_url": "finanzen.net",
                            "excerpt": "• ARK Invest verkauft Tesla-Anteile im Wert von 43,7 Millionen US-Dollar • Tesla-Aktie bleibt Top-Holding in drei ETFs • Cathie Wood sieht Tesla-Aktie falsch ...",
                            "summary": "• ARK Invest verkauft Tesla-Anteile im Wert von 43,7 Millionen US-Dollar• Tesla-Aktie bleibt Top-Holding in drei ETFs• Cathie Wood sieht Tesla-Aktie falsch bewertet Die starke Entwicklung der Tesla-Aktie im Jahr 2020 war einer der Hauptwachstumstreiber in den ETFs der Investmentfirma ARK Invest. Im April hatte das Unternehmen bei einem Aktienpreis von rund 719 US-Dollar dann zuletzt einige Tesla-Aktien aus dem Depot geworfen, jetzt war es erneut soweit. Tesla-Aktien verkauft: 43,7 Millionen US-Dollar eingenommen ARK veräußerte 63.643 Tesla-Aktien und hat bei dem Verkauf 43,7 Millionen US-Dollar eingenommen, das geht aus dem Trading-Update des Unternehmens hervor. Tesla ist die Top-Holding im Flaggschiff ETF ARK Innovation und ist ebenfalls die größte Beteiligung in zwei weiteren ARK-ETFs: Dem Ark Autonomous Technology & Robotics ETF und dem Ark Next Generation Internet ETF. Insgesamt befinden sich nun noch 4.873.916 Tesla-Aktien in den ETFs von ARK Invest, der Gesamtwert des Investments belief sich zuletzt auf rund 3,3 Milliarden US-Dollar. Tesla von falschen Analysten falsch bewertet Dass der Teil-Verkauf von Tesla-Aktien den Langzeit-Bullen Wood an dem Elektroautobauer zweifeln lässt, ist allerdings nicht anzunehmen. Noch vor Veröffentlichung der Quartalsbilanz von Tesla hatte Wood in einem Interview ihr Basis-Kursziel von 3.000 US-Dollar für die Tesla-Aktie bestätigt. Gegenüber \"Real Vision\" nahm die Investorin dabei auch Tesla-Analysten ins Visier, die ihrer Meinung nach mit dafür verantwortlich sind, dass Tesla am Markt falsch bewertet wird: \"Wir glauben, dass der Grund für eine so große Ineffizienz bei Teslas Bewertung der kurzfristige Zeithorizont der Analysten ist und die Tatsache, dass die falschen Analysten folgen\". Sie betonte, dass Tesla mehrheitlich von Auto-Analysten bewertet werde, dabei sei der Konzern von Elon Musk ein \"facettenreiches Technologieunternehmen\". Bei ARK hab man eine andere Herangehensweise, um die Aktie von Tesla korrekt bewerten zu können: \"Tesla ist ein Technologieunternehmen, aber nicht nur ein Technologieunternehmen\", sagte sie und nannte in dem Zusammenhang auch Energiespeicher, Robotik, künstliche Intelligenz und Software-as-a-Service. \"Wir haben also drei Analysten, die das Tesla-Modell zusammenbauen\", erklärte sie. ARK investiert in Innovation Die Investmentgesellschaft der Starinvestorin hat sich vorrangig auf die Marktsegmente Digitalisierung und Technologie konzentriert und das Portfolio ihrer ETFs konsequent darauf ausgerichtet. Der Fokus hat dafür gesorgt, dass ARK in den vergangenen Jahren eine starke Rendite erwirtschaften konnte und im vergangenen Jahr auch Investorenlegende Warren Buffett und seiner Holding Berkshire Hathaway den Rang abgelaufen hatte.",
                            "rights": "klamm.de",
                            "rank": 7420,
                            "topic": "news",
                            "country": "unknown",
                            "language": "de",
                            "authors": [],
                            "media": "https://static.klamm.de/news/news-img-k.jpg",
                            "is_opinion": false,
                            "twitter_account": null,
                            "_score": 13.178295,
                            "_id": "e3c5e3a88c985a015b6051812198670d"
                        },
                        {
                            "title": "How much does a Tesla weigh? Comparing each model",
                            "author": "Scooter Doll",
                            "published_date": "2021-08-02 08:23:00",
                            "published_date_precision": "full",
                            "link": "https://electrek.co/2021/08/02/how-much-does-a-tesla-weigh-comparing-each-model",
                            "clean_url": "electrek.co",
                            "excerpt": "When learning more about Tesla and its growing fleet of EVs, consumers new to the market have a lot of the same questions. Inquiries such as How much does a Tesla cost? How long does it take to charge a Tesla? How much does it cost to charge a Tesla? Believe it or not, one of the most frequent questions we receive in addition to those above is, How much does a Tesla weigh? \nWhile this question is more easily answered than others, there are a few factors that play a role in the weight of each Tesla model. Here's everything you need to know broken down by model.\n more…\nThe post How much does a Tesla weigh? Comparing each model appeared first on Electrek.",
                            "summary": "When learning more about Tesla and its growing fleet of EVs, consumers new to the market have a lot of the same questions. Inquiries such as How much does a Tesla cost? How long does it take to charge a Tesla? How much does it cost to charge a Tesla? Believe it or not, one of the most frequent questions we receive in addition to those above is, How much does a Tesla weigh?\n\nWhile this question is more easily answered than others, there are a few factors that play a role in the weight of each Tesla model. Here's everything you need to know broken down by model.\n\nHow much does each Tesla weigh?\n\nUnfortunately, your Tesla does not get an annual physical where a doctor can check in on your EV's weight, and there aren't too many vehicle-sized scales easily accessible to drivers.\n\nLuckily, Tesla has provided the weights of most of its vehicles, but they're still are varying factors.\n\nAside from different model types, some Teslas can vary in weight based on their trim or powertrain. Electric motors aren't as heavy ICE engine blocks, but they do carry some weight around.\n\nThat being said, more performance means more electric motors, and more motors mean additional weight.\n\nThe size and cargo space of the Tesla itself is also a pretty obvious factor, as a Model X will certainly weigh more than a Model 3 — and pretty much any other Tesla at this point.\n\nBelow is each Tesla's weight according to the American automaker, sorted by chronological debut.\n\nTesla's original Roadster EV\n\nTesla Roadster\n\nTesla's flagship EV remains its lightest model to date. The original Tesla Roadster sits as a limited-run EV and is now a collector's item for some, so its weight has not changed in the decade it's been around.\n\nThe first-generation Roadster weighs in at 2,723 lbs.\n\nModel S\n\nThe second oldest Tesla model on our list and the longest currently in production is the Model S sedan. After seeing a refresh earlier in 2021 that will eventually bring the tri-motor Plaid powertrain to drivers, the Model S can come with some weight.\n\nThe dual-motor Long Range trim, which has now been delayed to 2022, weighs 4,561 lbs.\n\nThe tri-motor Plaid Model S will weigh in at 4,766 lbs. when it (hopefully) delivers this fall.\n\nModel X\n\nThe largest current Tesla is unsurprisingly also the heaviest to date (we're still waiting on you, Cybertruck).\n\nCurrently available in two different trims, both the Long Range and new Plaid Model X weigh more than any of their Tesla siblings.\n\nThe Model X Long Range weighs 5,185 lbs., while the Plaid Model X and its three motors will weigh 5,390 lbs. Both trims are currently scheduled to arrive in the first quarter of 2022 alongside the Long Range Model S.\n\nModel 3\n\nThe cheapest Tesla available is also one of the very lightest, no matter the powertrain you choose. The Tesla Model 3 is currently available in three trims:\n\nThe single motor Model 3 Standard Range Plus is the second-lightest Tesla ever at 3,582 lbs.\n\nThe other two dual-motor Model 3 trims, Long Range and Performance, both weigh in at 4,065 lbs.\n\nModel Y\n\nThe newest Tesla to arrive currently sits in the middle of the pack on weight, which sits on brand with its pricing and performance as well.\n\nThe Tesla Model Y is currently available in either a Long Range or Performance dual-motor trim, and each weighs 4,416 lbs.\n\nWhat is the heaviest Tesla?\n\nIf you've skimmed through to this point, you must just be looking for weights and an answer to the question above without all the jibber-jabber. We respect that, so here you go.\n\nHere are all of Tesla's current models sorted heaviest to lightest:\n\n5,390 lbs – Model X Plaid\n\n5,185 lbs – Model X Long Range\n\n4,766 lbs – Model S Plaid\n\n4,561 lbs – Model S Long Range\n\n4,416 lbs – Model Y Long Range/Performance\n\n4,065 lbs – Model 3 Long Range/Performance\n\n3,582 lbs – Model 3 Standard Range Plus\n\n2,723 lbs Gen. 1 Tesla Roadster\n\nHow much does Tesla Cybertruck weigh?\n\nUnfortunately, we do not have that granular of specs on the upcoming Tesla Cybertruck yet, although we have asked Tesla several times.\n\nBased on the increased size and payload capacity (at least 3,500 lbs) compared to the current largest Tesla in the Model X, we anticipate the weight of the three upcoming powertrains on the Cybertruck to be between 5,000 and 6,500 lbs.\n\nThat being said, towing capacities up to 14,000 lbs., like Tesla is advertising for the tri-motor Cybertruck, could very well require more weight beyond 6,500 lbs.\n\nCheck back in with our Cybertruck guide periodically for the latest specs from Tesla.\n\nHow much does the 2nd generation Tesla Roadster weigh?\n\nMuch like the Cybertruck, Tesla has not yet revealed what the second-generation Roadster will tip the scales at when it debuts in 2022.\n\nBased on its size and touted performance, complete with new motors, we'd expect the new Roadster to land somewhere near the upcoming Model S trims, perhaps between 4,400 and 4,700 lbs.\n\nWe will know for certain when Tesla shares more details of the Gen. 2 Roadster… like whether it can actually hover or not.\n\nFTC: We use income earning auto affiliate links. More.\n\nSubscribe to Electrek on YouTube for exclusive videos and subscribe to the podcast.",
                            "rights": "electrek.co",
                            "rank": 3297,
                            "topic": "news",
                            "country": "US",
                            "language": "en",
                            "authors": [
                                "Scooter Doll"
                            ],
                            "media": "https://i1.wp.com/electrek.co/wp-content/uploads/sites/3/2021/08/Tesla-on-a-scale.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
                            "is_opinion": false,
                            "twitter_account": "@electrekco",
                            "_score": 13.09692,
                            "_id": "b9a2f7cabf9255d7e9ec19c6dc65018d"
                        }
                    ],
                    "user_input": {
                        "q": "Tesla",
                        "search_in": [
                            "title",
                            "summary"
                        ],
                        "lang": null,
                        "not_lang": null,
                        "countries": null,
                        "not_countries": null,
                        "from": "2021-08-02 00:00:00",
                        "to": null,
                        "ranked_only": "True",
                        "from_rank": null,
                        "to_rank": null,
                        "sort_by": "relevancy",
                        "page": 1,
                        "size": 2,
                        "sources": null,
                        "not_sources": null,
                        "topic": null,
                        "published_date_precision": null
                    }
                }
            },
            {
                "statusCode": 400,
                "name": null,
                "statusText": null,
                "methodType": "GET",
                "message": null,
                "description": null,
                "headers": [
                    {
                        "name": "Content-Type",
                        "value": "application/json"
                    }
                ],
                "cookies": null,
                "responseAttributes": [],
                "sampleData": {
                    "status": "error",
                    "error_code": "HeadersWithoutKey",
                    "message": "No API key was given. Please provide an API key and put it into headers, like 'x-api-key': 'YOUR_API_KEY'"
                }
            }
        ],
        "isMockResponseEnabled": false,
        "block_id": null,
        "gatewaySettings": null,
        "apiQueryModel": null,
        "properties": null,
        "vid": null,
        "nid": null
    },
    {
        "id": 126922,
        "executor_type": "THIRDPARTY",
        "executor_name": "checkyourSubscriptionplaninformation",
        "executor_version": "v3",
        "executor_display_name": "Check your subscription plan information",
        "executor_description": "This endpoint enables you to get info about your subscription plan.",
        "executor_category": "v3Subscription",
        "executor_category_group": "v3Subscription",
        "service_provider": "newscatcher",
        "executor_scope": null,
        "partner": "b2b",
        "account_id": "b2b",
        "executor_method_type": "POST",
        "apiUrl": "https://v3-api.newscatcherapi.com/api/subscription",
        "dataroot": null,
        "pathParams": [],
        "queryParams": [],
        "headers": [
            {
                "key": "x-api-key",
                "value": "",
                "description": "Your unique authentication token",
                "req": false
            },
            {
                "key": "Content-Type",
                "value": "application/json",
                "description": "",
                "req": false
            }
        ],
        "authModel": {
            "authType": "api_key",
            "authAttributes": {}
        },
        "requestBody": {
            "value": {
                "active": true,
                "concurrent_calls": 10,
                "plan": "v3_nlp_embeddings",
                "plan_calls": 100000,
                "remaining_calls": 99988,
                "historical_days": 2000
            },
            "key": "payload",
            "description": "Document in JSON format",
            "annotation": "RequestBody"
        },
        "prerequisites": null,
        "executors": null,
        "functions": null,
        "responseAttributes": [
            {
                "attributeName": null,
                "displayName": null,
                "description": null,
                "type": null,
                "size": 0,
                "precision": 0,
                "autoIncrement": false,
                "defaultValue": null,
                "subType": [],
                "attributeType": "None",
                "required": false,
                "dataStoragePolicy": "None",
                "apiAccessPolicy": "None",
                "displayPolicy": "None",
                "array": false,
                "customType": false,
                "updateOption": null,
                "previousAttributeName": null,
                "compliances": null
            }
        ],
        "response": null,
        "attributeMappings": null,
        "source": null,
        "block_attributes": null,
        "workflow_credentials": null,
        "disabled": false,
        "published": true,
        "scopeOfAccess": "public",
        "registeredAsIs": true,
        "creationTime": 1712304556488,
        "lastModifiedTime": 1712304556488,
        "executionLib": null,
        "isDocumentationPublished": true,
        "mockResponses": [
            {
                "statusCode": 200,
                "name": null,
                "statusText": null,
                "methodType": "GET",
                "message": "Success",
                "description": null,
                "headers": [
                    {
                        "name": "Content-Type",
                        "value": "application/json"
                    }
                ],
                "cookies": null,
                "responseAttributes": [],
                "sampleData": {
                    "active": true,
                    "concurrent_calls": 10,
                    "plan": "v3_nlp_embeddings",
                    "plan_calls": 100000,
                    "remaining_calls": 99988,
                    "historical_days": 2000
                }
            }
        ],
        "isMockResponseEnabled": false,
        "block_id": null,
        "gatewaySettings": null,
        "apiQueryModel": null,
        "properties": null,
        "vid": null,
        "nid": null
    },
    {
        "id": 126921,
        "executor_type": "THIRDPARTY",
        "executor_name": "checkyoursubscriptionplaninformation",
        "executor_version": "v3",
        "executor_display_name": "Check your subscription plan information",
        "executor_description": "This endpoint enables you to get info about your subscription plan.",
        "executor_category": "v3Subscription",
        "executor_category_group": "v3Subscription",
        "service_provider": "newscatcher",
        "executor_scope": null,
        "partner": "b2b",
        "account_id": "b2b",
        "executor_method_type": "GET",
        "apiUrl": "https://v3-api.newscatcherapi.com/api/subscription",
        "dataroot": null,
        "pathParams": [],
        "queryParams": [],
        "headers": [
            {
                "key": "x-api-key",
                "value": "",
                "description": "Your unique authentication token",
                "req": false
            }
        ],
        "authModel": {
            "authType": "api_key",
            "authAttributes": {}
        },
        "requestBody": {
            "value": "",
            "key": "payload",
            "description": "Document in JSON format",
            "annotation": "RequestBody"
        },
        "prerequisites": null,
        "executors": null,
        "functions": null,
        "responseAttributes": [
            {
                "attributeName": null,
                "displayName": null,
                "description": null,
                "type": null,
                "size": 0,
                "precision": 0,
                "autoIncrement": false,
                "defaultValue": null,
                "subType": [],
                "attributeType": "None",
                "required": false,
                "dataStoragePolicy": "None",
                "apiAccessPolicy": "None",
                "displayPolicy": "None",
                "array": false,
                "customType": false,
                "updateOption": null,
                "previousAttributeName": null,
                "compliances": null
            }
        ],
        "response": null,
        "attributeMappings": null,
        "source": null,
        "block_attributes": null,
        "workflow_credentials": null,
        "disabled": false,
        "published": true,
        "scopeOfAccess": "public",
        "registeredAsIs": true,
        "creationTime": 1712304445701,
        "lastModifiedTime": 1712304445701,
        "executionLib": null,
        "isDocumentationPublished": true,
        "mockResponses": [
            {
                "statusCode": 200,
                "name": null,
                "statusText": null,
                "methodType": "GET",
                "message": "Success",
                "description": null,
                "headers": [
                    {
                        "name": "Content-Type",
                        "value": "application/json"
                    }
                ],
                "cookies": null,
                "responseAttributes": [],
                "sampleData": {
                    "active": true,
                    "concurrent_calls": 10,
                    "plan": "v3_nlp_embeddings",
                    "plan_calls": 100000,
                    "remaining_calls": 99988,
                    "historical_days": 2000
                }
            }
        ],
        "isMockResponseEnabled": false,
        "block_id": null,
        "gatewaySettings": null,
        "apiQueryModel": null,
        "properties": null,
        "vid": null,
        "nid": null
    },
    {
        "id": 126916,
        "executor_type": "THIRDPARTY",
        "executor_name": "getnews",
        "executor_version": "v3",
        "executor_display_name": "Get Sources",
        "executor_description": "Main endpoint that allows you to find news article by keyword, date, language, country, etc.",
        "executor_category": "v3SearchNews",
        "executor_category_group": "v3SearchNews",
        "service_provider": "newscatcher",
        "executor_scope": null,
        "partner": "b2b",
        "account_id": "b2b",
        "executor_method_type": "POST",
        "apiUrl": "https://v3-api.newscatcherapi.com/api/search",
        "dataroot": null,
        "pathParams": [],
        "queryParams": [
            {
                "key": "q",
                "value": "",
                "description": "Keyword/keywords you're searching for. This is the most important part of your query.  You can set this to '*' if you don't want to look for specific keywords.   Please, refer to the Advanced Querying page for more examples and explanations.",
                "req": false
            },
            {
                "key": "lang",
                "value": "",
                "description": "Specifies the languages of the search. For example,  en .  The only accepted format is ISO 639-1 — 2 letter code.  Refer to the language format section for more details.",
                "req": false
            },
            {
                "key": "not_lang",
                "value": "",
                "description": "Inverse to the  lang  parameter",
                "req": false
            },
            {
                "key": "published_date_precision",
                "value": "",
                "description": "There are 3 types of date precision we define:   full  — day and time of an article is correctly identified with the appropriate timezone   timezone unknown  — day and time of an article is correctly identified without timezone   date  — only the day is identified without an exact time",
                "req": false
            },
            {
                "key": "search_in",
                "value": "",
                "description": "By default, we search what you specified in the  q  parameter in both  title  and  content  of the article.   However, you can choose between:  -title    -content    -summary  (if enabled for your plan)  -title,summary  -content,summary",
                "req": false
            },
            {
                "key": "countries",
                "value": "",
                "description": "Countries where the news publisher is located.  Important: This parameter is not responsible for the countries mentioned in the news article.  One or multiple countries can be used in the search.  The only acceptable format is ISO 3166-1 alpha-2  For example,  US,CA,MX  or just  US",
                "req": false
            },
            {
                "key": "not_countries",
                "value": "",
                "description": "The inverse of the  countries  parameter.",
                "req": false
            },
            {
                "key": "sources",
                "value": "",
                "description": "One or more news sources to narrow down your search.   The format should be a domain url from your URL. Subdomains, like  finance.yahoo.com   are also accepted. Comma-separated string or a list/array.   For example,  nytimes.com,theguardian.com,finance.yahoo.com",
                "req": false
            },
            {
                "key": "not_sources",
                "value": "",
                "description": "One or more sources to be excluded from the search.   Comma-separated string or a list/array.   For example,  cnn.com,wsj.com",
                "req": false
            },
            {
                "key": "ranked_only",
                "value": "",
                "description": "Default:  True   Limit the search only for the sources which are in the top 1 million online websites. Unranked sources are assigned a rank that equals   999999",
                "req": false
            },
            {
                "key": "from_rank",
                "value": "",
                "description": "[0:999999]  The lowest boundary of the rank of a news website to filter by.   Important: lower rank means that a source is more popular",
                "req": false
            },
            {
                "key": "to_rank",
                "value": "",
                "description": "[0:999999]  The upper boundary of the rank of a news website to filter by.",
                "req": false
            },
            {
                "key": "sort_by",
                "value": "",
                "description": "relevancy  (default value) — the most relevant results first   date  — the most recently published results first   rank  — the results from the highest-ranked sources first",
                "req": false
            },
            {
                "key": "page_size",
                "value": "",
                "description": " How many articles to return per page.",
                "req": false
            },
            {
                "key": "page",
                "value": "",
                "description": "The number of the page. Use it to scroll through the results.   This parameter is used to paginate: scroll through results because one API response cannot return more than 1000 articles.",
                "req": false
            },
            {
                "key": "to_",
                "value": "",
                "description": "Until which point in time to search for. The default timezone is UTC.   Availabe formats :  YYYY/mm/dd    YYYY/mm/dd HH:MM:SS     English phrases like 1 day ago",
                "req": false
            },
            {
                "key": "from_",
                "value": "",
                "description": "From which point in time to start the search. Defaults to the past week.  Availabe formats :  YYYY/mm/dd   YYYY/mm/dd HH:MM:SS    English phrases like  1 day ago  ",
                "req": false
            },
            {
                "key": "by_parse_date",
                "value": "",
                "description": "When set to True, transforms your from_ and to_ parameters to filter by parse_date instead of published_date  Be aware that a new variable parse_date will be added to the output list with each article. ",
                "req": false
            },
            {
                "key": "is_headline",
                "value": "",
                "description": "When set to True, only articles that were posted on the home page of a given news domain will be shown.",
                "req": false
            },
            {
                "key": "parent_url",
                "value": "",
                "description": "One or more categorical URL to filter your search. It should be the normal form of the URL,  For example,  https://www.washingtonpost.com/politics , https://www.washingtonpost.com/technology,https://www.washingtonpost.com/business",
                "req": false
            },
            {
                "key": "all_links",
                "value": "",
                "description": "Search for desired URL mentioned in the article.   Please, refer to the All Links And Domains Format pagefor more examples and explanations.",
                "req": false
            },
            {
                "key": "all_domain_links",
                "value": "",
                "description": "Search for desired domain URL mentioned in the article.   Please, refer to the All Links And Domains Format page for more examples and explanations.",
                "req": false
            },
            {
                "key": "word_count_min",
                "value": "",
                "description": "Set a minimum number of words that an article must contain.   To be used for avoiding avoid articles with small content.",
                "req": false
            },
            {
                "key": "word_count_max",
                "value": "",
                "description": "Set a maximum number of words that an article must contain.   To be used for avoiding avoid articles with big content.",
                "req": false
            },
            {
                "key": "include_nlp_data",
                "value": "",
                "description": "When set to True, adds to each article a NLP layer.  Not available for all plans. Please contact us to enable it.",
                "req": false
            }
        ],
        "headers": [
            {
                "key": "x-api-key",
                "value": "",
                "description": "Your unique authentication token",
                "req": false
            },
            {
                "key": "Content-Type",
                "value": "application/json",
                "description": "",
                "req": false
            }
        ],
        "authModel": {
            "authType": "api_key",
            "authAttributes": {}
        },
        "requestBody": null,
        "prerequisites": null,
        "executors": null,
        "functions": null,
        "responseAttributes": [
            {
                "attributeName": null,
                "displayName": null,
                "description": null,
                "type": null,
                "size": 0,
                "precision": 0,
                "autoIncrement": false,
                "defaultValue": null,
                "subType": [],
                "attributeType": "None",
                "required": false,
                "dataStoragePolicy": "None",
                "apiAccessPolicy": "None",
                "displayPolicy": "None",
                "array": false,
                "customType": false,
                "updateOption": null,
                "previousAttributeName": null,
                "compliances": null
            }
        ],
        "response": null,
        "attributeMappings": null,
        "source": null,
        "block_attributes": null,
        "workflow_credentials": null,
        "disabled": false,
        "published": true,
        "scopeOfAccess": "public",
        "registeredAsIs": true,
        "creationTime": 1712303215824,
        "lastModifiedTime": 1712303215824,
        "executionLib": null,
        "isDocumentationPublished": true,
        "mockResponses": [
            {
                "statusCode": 200,
                "name": null,
                "statusText": null,
                "methodType": "GET",
                "message": "Success",
                "description": null,
                "headers": [
                    {
                        "name": "Content-Type",
                        "value": "application/json"
                    }
                ],
                "cookies": null,
                "responseAttributes": [],
                "sampleData": {
                    "message": "Maximum sources displayed according to your plan is set to 100",
                    "sources": [
                        "businessinsider.com",
                        "forbes.com",
                        "apnews.com",
                        "yahoo.com",
                        "newstimes.com",
                        "timesunion.com",
                        "ourmidland.com",
                        "stamfordadvocate.com",
                        "thetelegraph.com",
                        "fairfieldcitizenonline.com",
                        "newmilfordspectrum.com",
                        "nhregister.com",
                        "sfchronicle.com",
                        "sheltonherald.com",
                        "greenwichtime.com",
                        "seattlepi.com",
                        "sfgate.com",
                        "westport-news.com",
                        "myjournalcourier.com",
                        "registercitizen.com",
                        "theintelligencer.com",
                        "beaumontenterprise.com",
                        "ctpost.com",
                        "lmtonline.com",
                        "middletownpress.com",
                        "mrt.com",
                        "thehour.com",
                        "chron.com",
                        "michigansthumb.com",
                        "milfordmirror.com",
                        "mysanantonio.com",
                        "thecourierexpress.com",
                        "cnbc.com",
                        "thedailytimes.com",
                        "myplainview.com",
                        "wiltonbulletin.com",
                        "theridgefieldpress.com",
                        "bigrapidsnews.com",
                        "manisteenews.com",
                        "ncadvertiser.com",
                        "trumbulltimes.com",
                        "google.com",
                        "sandiegouniontribune.com",
                        "youtube.com",
                        "si.com",
                        "yardbarker.com",
                        "nasdaq.com",
                        "bloomberg.com",
                        "bozemandailychronicle.com",
                        "reuters.com",
                        "blackenterprise.com",
                        "seekingalpha.com",
                        "stltoday.com",
                        "cbs42.com",
                        "reddit.com",
                        "detroitnews.com",
                        "wric.com",
                        "washingtonpost.com",
                        "benzinga.com",
                        "inc.com",
                        "sacbee.com",
                        "timescolonist.com",
                        "muscatinejournal.com",
                        "businessreport.com",
                        "click2houston.com",
                        "deadline.com",
                        "ksat.com",
                        "marketscreener.com",
                        "tapinto.net",
                        "tucson.com",
                        "bradenton.com",
                        "cheatsheet.com",
                        "cnn.com",
                        "darientimes.com",
                        "nbcconnecticut.com",
                        "patch.com",
                        "tri-cityherald.com",
                        "billboard.com",
                        "businessjournaldaily.com",
                        "coindesk.com",
                        "fastcompany.com",
                        "fortune.com",
                        "foxbusiness.com",
                        "heraldonline.com",
                        "khn.org",
                        "nbcnewyork.com",
                        "news24.com",
                        "nytimes.com",
                        "techcrunch.com",
                        "thenewstribune.com",
                        "thenextweb.com",
                        "argusleader.com",
                        "bizjournals.com",
                        "brinkwire.com",
                        "cbslocal.com",
                        "kansas.com",
                        "looper.com",
                        "news4jax.com",
                        "republicworld.com",
                        "americanbankingnews.com"
                    ],
                    "user_input": {
                        "lang": [
                            "en"
                        ],
                        "countries": [
                            "US"
                        ],
                        "topic": "business"
                    }
                }
            }
        ],
        "isMockResponseEnabled": false,
        "block_id": null,
        "gatewaySettings": null,
        "apiQueryModel": null,
        "properties": null,
        "vid": null,
        "nid": null
    },
    {
        "id": 126915,
        "executor_type": "THIRDPARTY",
        "executor_name": "getNews",
        "executor_version": "v3",
        "executor_display_name": "Get Sources",
        "executor_description": "Main endpoint that allows you to find news article by keyword, date, language, country, etc.",
        "executor_category": "v3SearchNews",
        "executor_category_group": "v3SearchNews",
        "service_provider": "newscatcher",
        "executor_scope": null,
        "partner": "b2b",
        "account_id": "b2b",
        "executor_method_type": "GET",
        "apiUrl": "https://v3-api.newscatcherapi.com/api/search",
        "dataroot": null,
        "pathParams": [],
        "queryParams": [
            {
                "key": "q",
                "value": "",
                "description": "Keyword/keywords you're searching for. This is the most important part of your query.  You can set this to '*' if you don't want to look for specific keywords.   Please, refer to the Advanced Querying page for more examples and explanations.",
                "req": false
            },
            {
                "key": "lang",
                "value": "",
                "description": "Specifies the languages of the search. For example,  en .  The only accepted format is ISO 639-1 — 2 letter code.  Refer to the language format section for more details.",
                "req": false
            },
            {
                "key": "not_lang",
                "value": "",
                "description": "Inverse to the  lang  parameter",
                "req": false
            },
            {
                "key": "published_date_precision",
                "value": "",
                "description": "There are 3 types of date precision we define:   full  — day and time of an article is correctly identified with the appropriate timezone   timezone unknown  — day and time of an article is correctly identified without timezone   date  — only the day is identified without an exact time",
                "req": false
            },
            {
                "key": "search_in",
                "value": "",
                "description": "By default, we search what you specified in the  q  parameter in both  title  and  content  of the article.   However, you can choose between:  -title    -content    -summary  (if enabled for your plan)  -title,summary  -content,summary",
                "req": false
            },
            {
                "key": "countries",
                "value": "",
                "description": "Countries where the news publisher is located.  Important: This parameter is not responsible for the countries mentioned in the news article.  One or multiple countries can be used in the search.  The only acceptable format is ISO 3166-1 alpha-2  For example,  US,CA,MX  or just  US",
                "req": false
            },
            {
                "key": "not_countries",
                "value": "",
                "description": "The inverse of the  countries  parameter.",
                "req": false
            },
            {
                "key": "sources",
                "value": "",
                "description": "One or more news sources to narrow down your search.   The format should be a domain url from your URL. Subdomains, like  finance.yahoo.com   are also accepted. Comma-separated string or a list/array.   For example,  nytimes.com,theguardian.com,finance.yahoo.com",
                "req": false
            },
            {
                "key": "not_sources",
                "value": "",
                "description": "One or more sources to be excluded from the search.   Comma-separated string or a list/array.   For example,  cnn.com,wsj.com",
                "req": false
            },
            {
                "key": "ranked_only",
                "value": "",
                "description": "Default:  True   Limit the search only for the sources which are in the top 1 million online websites. Unranked sources are assigned a rank that equals   999999",
                "req": false
            },
            {
                "key": "from_rank",
                "value": "",
                "description": "[0:999999]  The lowest boundary of the rank of a news website to filter by.   Important: lower rank means that a source is more popular",
                "req": false
            },
            {
                "key": "to_rank",
                "value": "",
                "description": "[0:999999]  The upper boundary of the rank of a news website to filter by.",
                "req": false
            },
            {
                "key": "sort_by",
                "value": "",
                "description": "relevancy  (default value) — the most relevant results first   date  — the most recently published results first   rank  — the results from the highest-ranked sources first",
                "req": false
            },
            {
                "key": "page_size",
                "value": "",
                "description": " How many articles to return per page.",
                "req": false
            },
            {
                "key": "page",
                "value": "",
                "description": "The number of the page. Use it to scroll through the results.   This parameter is used to paginate: scroll through results because one API response cannot return more than 1000 articles.",
                "req": false
            },
            {
                "key": "to_",
                "value": "",
                "description": "Until which point in time to search for. The default timezone is UTC.   Availabe formats :  YYYY/mm/dd    YYYY/mm/dd HH:MM:SS     English phrases like 1 day ago",
                "req": false
            },
            {
                "key": "from_",
                "value": "",
                "description": "From which point in time to start the search. Defaults to the past week.  Availabe formats :  YYYY/mm/dd   YYYY/mm/dd HH:MM:SS    English phrases like  1 day ago  ",
                "req": false
            },
            {
                "key": "by_parse_date",
                "value": "",
                "description": "When set to True, transforms your from_ and to_ parameters to filter by parse_date instead of published_date  Be aware that a new variable parse_date will be added to the output list with each article. ",
                "req": false
            },
            {
                "key": "is_headline",
                "value": "",
                "description": "When set to True, only articles that were posted on the home page of a given news domain will be shown.",
                "req": false
            },
            {
                "key": "parent_url",
                "value": "",
                "description": "One or more categorical URL to filter your search. It should be the normal form of the URL,  For example,  https://www.washingtonpost.com/politics , https://www.washingtonpost.com/technology,https://www.washingtonpost.com/business",
                "req": false
            },
            {
                "key": "all_links",
                "value": "",
                "description": "Search for desired URL mentioned in the article.   Please, refer to the All Links And Domains Format pagefor more examples and explanations.",
                "req": false
            },
            {
                "key": "all_domain_links",
                "value": "",
                "description": "Search for desired domain URL mentioned in the article.   Please, refer to the All Links And Domains Format page for more examples and explanations.",
                "req": false
            },
            {
                "key": "word_count_min",
                "value": "",
                "description": "Set a minimum number of words that an article must contain.   To be used for avoiding avoid articles with small content.",
                "req": false
            },
            {
                "key": "word_count_max",
                "value": "",
                "description": "Set a maximum number of words that an article must contain.   To be used for avoiding avoid articles with big content.",
                "req": false
            },
            {
                "key": "include_nlp_data",
                "value": "",
                "description": "When set to True, adds to each article a NLP layer.  Not available for all plans. Please contact us to enable it.",
                "req": false
            }
        ],
        "headers": [
            {
                "key": "x-api-key",
                "value": "",
                "description": "Your unique authentication token",
                "req": false
            }
        ],
        "authModel": {
            "authType": "api_key",
            "authAttributes": {}
        },
        "requestBody": {
            "value": "",
            "key": "payload",
            "description": "Document in JSON format",
            "annotation": "RequestBody"
        },
        "prerequisites": null,
        "executors": null,
        "functions": null,
        "responseAttributes": [
            {
                "attributeName": null,
                "displayName": null,
                "description": null,
                "type": null,
                "size": 0,
                "precision": 0,
                "autoIncrement": false,
                "defaultValue": null,
                "subType": [],
                "attributeType": "None",
                "required": false,
                "dataStoragePolicy": "None",
                "apiAccessPolicy": "None",
                "displayPolicy": "None",
                "array": false,
                "customType": false,
                "updateOption": null,
                "previousAttributeName": null,
                "compliances": null
            }
        ],
        "response": null,
        "attributeMappings": null,
        "source": null,
        "block_attributes": null,
        "workflow_credentials": null,
        "disabled": false,
        "published": true,
        "scopeOfAccess": "public",
        "registeredAsIs": true,
        "creationTime": 1712303083107,
        "lastModifiedTime": 1712303083107,
        "executionLib": null,
        "isDocumentationPublished": true,
        "mockResponses": [
            {
                "statusCode": 200,
                "name": null,
                "statusText": null,
                "methodType": "GET",
                "message": "Success",
                "description": null,
                "headers": [
                    {
                        "name": "Content-Type",
                        "value": "application/json"
                    }
                ],
                "cookies": null,
                "responseAttributes": [],
                "sampleData": {
                    "message": "Maximum sources displayed according to your plan is set to 100",
                    "sources": [
                        "businessinsider.com",
                        "forbes.com",
                        "apnews.com",
                        "yahoo.com",
                        "newstimes.com",
                        "timesunion.com",
                        "ourmidland.com",
                        "stamfordadvocate.com",
                        "thetelegraph.com",
                        "fairfieldcitizenonline.com",
                        "newmilfordspectrum.com",
                        "nhregister.com",
                        "sfchronicle.com",
                        "sheltonherald.com",
                        "greenwichtime.com",
                        "seattlepi.com",
                        "sfgate.com",
                        "westport-news.com",
                        "myjournalcourier.com",
                        "registercitizen.com",
                        "theintelligencer.com",
                        "beaumontenterprise.com",
                        "ctpost.com",
                        "lmtonline.com",
                        "middletownpress.com",
                        "mrt.com",
                        "thehour.com",
                        "chron.com",
                        "michigansthumb.com",
                        "milfordmirror.com",
                        "mysanantonio.com",
                        "thecourierexpress.com",
                        "cnbc.com",
                        "thedailytimes.com",
                        "myplainview.com",
                        "wiltonbulletin.com",
                        "theridgefieldpress.com",
                        "bigrapidsnews.com",
                        "manisteenews.com",
                        "ncadvertiser.com",
                        "trumbulltimes.com",
                        "google.com",
                        "sandiegouniontribune.com",
                        "youtube.com",
                        "si.com",
                        "yardbarker.com",
                        "nasdaq.com",
                        "bloomberg.com",
                        "bozemandailychronicle.com",
                        "reuters.com",
                        "blackenterprise.com",
                        "seekingalpha.com",
                        "stltoday.com",
                        "cbs42.com",
                        "reddit.com",
                        "detroitnews.com",
                        "wric.com",
                        "washingtonpost.com",
                        "benzinga.com",
                        "inc.com",
                        "sacbee.com",
                        "timescolonist.com",
                        "muscatinejournal.com",
                        "businessreport.com",
                        "click2houston.com",
                        "deadline.com",
                        "ksat.com",
                        "marketscreener.com",
                        "tapinto.net",
                        "tucson.com",
                        "bradenton.com",
                        "cheatsheet.com",
                        "cnn.com",
                        "darientimes.com",
                        "nbcconnecticut.com",
                        "patch.com",
                        "tri-cityherald.com",
                        "billboard.com",
                        "businessjournaldaily.com",
                        "coindesk.com",
                        "fastcompany.com",
                        "fortune.com",
                        "foxbusiness.com",
                        "heraldonline.com",
                        "khn.org",
                        "nbcnewyork.com",
                        "news24.com",
                        "nytimes.com",
                        "techcrunch.com",
                        "thenewstribune.com",
                        "thenextweb.com",
                        "argusleader.com",
                        "bizjournals.com",
                        "brinkwire.com",
                        "cbslocal.com",
                        "kansas.com",
                        "looper.com",
                        "news4jax.com",
                        "republicworld.com",
                        "americanbankingnews.com"
                    ],
                    "user_input": {
                        "lang": [
                            "en"
                        ],
                        "countries": [
                            "US"
                        ],
                        "topic": "business"
                    }
                }
            }
        ],
        "isMockResponseEnabled": false,
        "block_id": null,
        "gatewaySettings": null,
        "apiQueryModel": null,
        "properties": null,
        "vid": null,
        "nid": null
    },
    {
        "id": 126912,
        "executor_type": "THIRDPARTY",
        "executor_name": "getlatestHeadlines",
        "executor_version": "v2",
        "executor_display_name": "Get Latest Headlines",
        "executor_description": "Get the latest headlines given any topic, country, source or language",
        "executor_category": "LatestHeadlines",
        "executor_category_group": "LatestHeadlines",
        "service_provider": "newscatcher",
        "executor_scope": null,
        "partner": "b2b",
        "account_id": "b2b",
        "executor_method_type": "POST",
        "apiUrl": "https://api.newscatcherapi.com/v2/latest_headlines",
        "dataroot": null,
        "pathParams": [],
        "queryParams": [
            {
                "key": "ranked_only",
                "value": "",
                "description": "Default: True  Limit the search only for the sources which are in the top 1 million online websites. Unranked sources are assigned a rank that equals 999999",
                "req": false
            },
            {
                "key": "when",
                "value": "",
                "description": "The time period you want to get the latest headlines for.  Accepted forms: - 7d => Dailly Form (last 7 days time period),  30d  (last 30 days time period) - 1h => Hourly Form (last hour), 24h (last 24 hours)  Default: The number of historic data available for your subscription plan",
                "req": false
            },
            {
                "key": "lang",
                "value": "",
                "description": "Specifies the languages of the search. For example,  en .  The only accepted format is ISO 639-1 — 2 letter code.  Refer to the Allowed Languages section for more details.",
                "req": false
            },
            {
                "key": "countries",
                "value": "",
                "description": "Countries where the news publisher is located.  Important: This parameter is not responsible for the countries mentioned in the news article.  One or multiple countries can be used in the search.  The only acceptable format is ISO 3166-1 alpha-2  For example,  US,CA,MX  or just  US",
                "req": false
            },
            {
                "key": "not_countries",
                "value": "",
                "description": "The inverse of the  countries  parameter.",
                "req": false
            },
            {
                "key": "topic",
                "value": "",
                "description": "Accepted values:  news ,  sport , tech ,  world ,  finance , politics ,  business ,  economics ,  entertainment ,  beauty ,  travel ,  music ,  food ,  science ,  gaming ,  energy . The topic to which you want to restrict the articles of your choice.  Not all news articles are assigned with a topic, therefore, we cannot guarantee that 100% of topics talking about technology will be assigned a tech label.",
                "req": false
            },
            {
                "key": "sources",
                "value": "",
                "description": "One or more news resources to filter your search. It should be the normal form of the URL,  For example,  nytimes.com,theguardian.com",
                "req": false
            },
            {
                "key": "not_sources",
                "value": "",
                "description": "One or more sources to be excluded from the search.   Comma-separated list. For example,  wsj.com",
                "req": false
            },
            {
                "key": "page_size",
                "value": "",
                "description": "[1:100]  How many articles to return per page.",
                "req": false
            },
            {
                "key": "page",
                "value": "",
                "description": "The number of the page. Use it to scroll through the results.   This parameter is used to paginate: scroll through results because one API response cannot return more than 100 articles.",
                "req": false
            }
        ],
        "headers": [
            {
                "key": "x-api-key",
                "value": "",
                "description": "Your unique authentication token",
                "req": false
            },
            {
                "key": "Content-Type",
                "value": "application/json",
                "description": "",
                "req": false
            }
        ],
        "authModel": {
            "authType": "api_key",
            "authAttributes": {}
        },
        "requestBody": {
            "value": {},
            "key": "payload",
            "description": "Document in JSON format",
            "annotation": "RequestBody"
        },
        "prerequisites": null,
        "executors": null,
        "functions": null,
        "responseAttributes": [
            {
                "attributeName": null,
                "displayName": null,
                "description": null,
                "type": null,
                "size": 0,
                "precision": 0,
                "autoIncrement": false,
                "defaultValue": null,
                "subType": [],
                "attributeType": "None",
                "required": false,
                "dataStoragePolicy": "None",
                "apiAccessPolicy": "None",
                "displayPolicy": "None",
                "array": false,
                "customType": false,
                "updateOption": null,
                "previousAttributeName": null,
                "compliances": null
            }
        ],
        "response": null,
        "attributeMappings": null,
        "source": null,
        "block_attributes": null,
        "workflow_credentials": null,
        "disabled": false,
        "published": true,
        "scopeOfAccess": "public",
        "registeredAsIs": true,
        "creationTime": 1712300693963,
        "lastModifiedTime": 1712300693963,
        "executionLib": null,
        "isDocumentationPublished": true,
        "mockResponses": [
            {
                "statusCode": 200,
                "name": null,
                "statusText": null,
                "methodType": "GET",
                "message": "Success",
                "description": null,
                "headers": [
                    {
                        "name": "Content-Type",
                        "value": "application/json"
                    }
                ],
                "cookies": null,
                "responseAttributes": [],
                "sampleData": {
                    "status": "ok",
                    "total_hits": 10000,
                    "page": 1,
                    "total_pages": 5000,
                    "page_size": 2,
                    "articles": [
                        {
                            "title": "ARK reduziert Anteile: Cathie Wood wirft Tesla-Aktien aus dem Depot",
                            "author": null,
                            "published_date": "2021-08-04 01:15:00",
                            "published_date_precision": "full",
                            "link": "https://www.finanzen.net/nachricht/aktien/beteiligung-reduziert-ark-reduziert-anteile-cathie-wood-wirft-tesla-aktien-aus-dem-depot-10402608",
                            "clean_url": "finanzen.net",
                            "excerpt": "• ARK Invest verkauft Tesla-Anteile im Wert von 43,7 Millionen US-Dollar • Tesla-Aktie bleibt Top-Holding in drei ETFs • Cathie Wood sieht Tesla-Aktie falsch ...",
                            "summary": "• ARK Invest verkauft Tesla-Anteile im Wert von 43,7 Millionen US-Dollar• Tesla-Aktie bleibt Top-Holding in drei ETFs• Cathie Wood sieht Tesla-Aktie falsch bewertet Die starke Entwicklung der Tesla-Aktie im Jahr 2020 war einer der Hauptwachstumstreiber in den ETFs der Investmentfirma ARK Invest. Im April hatte das Unternehmen bei einem Aktienpreis von rund 719 US-Dollar dann zuletzt einige Tesla-Aktien aus dem Depot geworfen, jetzt war es erneut soweit. Tesla-Aktien verkauft: 43,7 Millionen US-Dollar eingenommen ARK veräußerte 63.643 Tesla-Aktien und hat bei dem Verkauf 43,7 Millionen US-Dollar eingenommen, das geht aus dem Trading-Update des Unternehmens hervor. Tesla ist die Top-Holding im Flaggschiff ETF ARK Innovation und ist ebenfalls die größte Beteiligung in zwei weiteren ARK-ETFs: Dem Ark Autonomous Technology & Robotics ETF und dem Ark Next Generation Internet ETF. Insgesamt befinden sich nun noch 4.873.916 Tesla-Aktien in den ETFs von ARK Invest, der Gesamtwert des Investments belief sich zuletzt auf rund 3,3 Milliarden US-Dollar. Tesla von falschen Analysten falsch bewertet Dass der Teil-Verkauf von Tesla-Aktien den Langzeit-Bullen Wood an dem Elektroautobauer zweifeln lässt, ist allerdings nicht anzunehmen. Noch vor Veröffentlichung der Quartalsbilanz von Tesla hatte Wood in einem Interview ihr Basis-Kursziel von 3.000 US-Dollar für die Tesla-Aktie bestätigt. Gegenüber \"Real Vision\" nahm die Investorin dabei auch Tesla-Analysten ins Visier, die ihrer Meinung nach mit dafür verantwortlich sind, dass Tesla am Markt falsch bewertet wird: \"Wir glauben, dass der Grund für eine so große Ineffizienz bei Teslas Bewertung der kurzfristige Zeithorizont der Analysten ist und die Tatsache, dass die falschen Analysten folgen\". Sie betonte, dass Tesla mehrheitlich von Auto-Analysten bewertet werde, dabei sei der Konzern von Elon Musk ein \"facettenreiches Technologieunternehmen\". Bei ARK hab man eine andere Herangehensweise, um die Aktie von Tesla korrekt bewerten zu können: \"Tesla ist ein Technologieunternehmen, aber nicht nur ein Technologieunternehmen\", sagte sie und nannte in dem Zusammenhang auch Energiespeicher, Robotik, künstliche Intelligenz und Software-as-a-Service. \"Wir haben also drei Analysten, die das Tesla-Modell zusammenbauen\", erklärte sie. ARK investiert in Innovation Die Investmentgesellschaft der Starinvestorin hat sich vorrangig auf die Marktsegmente Digitalisierung und Technologie konzentriert und das Portfolio ihrer ETFs konsequent darauf ausgerichtet. Der Fokus hat dafür gesorgt, dass ARK in den vergangenen Jahren eine starke Rendite erwirtschaften konnte und im vergangenen Jahr auch Investorenlegende Warren Buffett und seiner Holding Berkshire Hathaway den Rang abgelaufen hatte.",
                            "rights": "klamm.de",
                            "rank": 7420,
                            "topic": "news",
                            "country": "unknown",
                            "language": "de",
                            "authors": [],
                            "media": "https://static.klamm.de/news/news-img-k.jpg",
                            "is_opinion": false,
                            "twitter_account": null,
                            "_score": 13.178295,
                            "_id": "e3c5e3a88c985a015b6051812198670d"
                        },
                        {
                            "title": "How much does a Tesla weigh? Comparing each model",
                            "author": "Scooter Doll",
                            "published_date": "2021-08-02 08:23:00",
                            "published_date_precision": "full",
                            "link": "https://electrek.co/2021/08/02/how-much-does-a-tesla-weigh-comparing-each-model",
                            "clean_url": "electrek.co",
                            "excerpt": "When learning more about Tesla and its growing fleet of EVs, consumers new to the market have a lot of the same questions. Inquiries such as How much does a Tesla cost? How long does it take to charge a Tesla? How much does it cost to charge a Tesla? Believe it or not, one of the most frequent questions we receive in addition to those above is, How much does a Tesla weigh? \nWhile this question is more easily answered than others, there are a few factors that play a role in the weight of each Tesla model. Here's everything you need to know broken down by model.\n more…\nThe post How much does a Tesla weigh? Comparing each model appeared first on Electrek.",
                            "summary": "When learning more about Tesla and its growing fleet of EVs, consumers new to the market have a lot of the same questions. Inquiries such as How much does a Tesla cost? How long does it take to charge a Tesla? How much does it cost to charge a Tesla? Believe it or not, one of the most frequent questions we receive in addition to those above is, How much does a Tesla weigh?\n\nWhile this question is more easily answered than others, there are a few factors that play a role in the weight of each Tesla model. Here's everything you need to know broken down by model.\n\nHow much does each Tesla weigh?\n\nUnfortunately, your Tesla does not get an annual physical where a doctor can check in on your EV's weight, and there aren't too many vehicle-sized scales easily accessible to drivers.\n\nLuckily, Tesla has provided the weights of most of its vehicles, but they're still are varying factors.\n\nAside from different model types, some Teslas can vary in weight based on their trim or powertrain. Electric motors aren't as heavy ICE engine blocks, but they do carry some weight around.\n\nThat being said, more performance means more electric motors, and more motors mean additional weight.\n\nThe size and cargo space of the Tesla itself is also a pretty obvious factor, as a Model X will certainly weigh more than a Model 3 — and pretty much any other Tesla at this point.\n\nBelow is each Tesla's weight according to the American automaker, sorted by chronological debut.\n\nTesla's original Roadster EV\n\nTesla Roadster\n\nTesla's flagship EV remains its lightest model to date. The original Tesla Roadster sits as a limited-run EV and is now a collector's item for some, so its weight has not changed in the decade it's been around.\n\nThe first-generation Roadster weighs in at 2,723 lbs.\n\nModel S\n\nThe second oldest Tesla model on our list and the longest currently in production is the Model S sedan. After seeing a refresh earlier in 2021 that will eventually bring the tri-motor Plaid powertrain to drivers, the Model S can come with some weight.\n\nThe dual-motor Long Range trim, which has now been delayed to 2022, weighs 4,561 lbs.\n\nThe tri-motor Plaid Model S will weigh in at 4,766 lbs. when it (hopefully) delivers this fall.\n\nModel X\n\nThe largest current Tesla is unsurprisingly also the heaviest to date (we're still waiting on you, Cybertruck).\n\nCurrently available in two different trims, both the Long Range and new Plaid Model X weigh more than any of their Tesla siblings.\n\nThe Model X Long Range weighs 5,185 lbs., while the Plaid Model X and its three motors will weigh 5,390 lbs. Both trims are currently scheduled to arrive in the first quarter of 2022 alongside the Long Range Model S.\n\nModel 3\n\nThe cheapest Tesla available is also one of the very lightest, no matter the powertrain you choose. The Tesla Model 3 is currently available in three trims:\n\nThe single motor Model 3 Standard Range Plus is the second-lightest Tesla ever at 3,582 lbs.\n\nThe other two dual-motor Model 3 trims, Long Range and Performance, both weigh in at 4,065 lbs.\n\nModel Y\n\nThe newest Tesla to arrive currently sits in the middle of the pack on weight, which sits on brand with its pricing and performance as well.\n\nThe Tesla Model Y is currently available in either a Long Range or Performance dual-motor trim, and each weighs 4,416 lbs.\n\nWhat is the heaviest Tesla?\n\nIf you've skimmed through to this point, you must just be looking for weights and an answer to the question above without all the jibber-jabber. We respect that, so here you go.\n\nHere are all of Tesla's current models sorted heaviest to lightest:\n\n5,390 lbs – Model X Plaid\n\n5,185 lbs – Model X Long Range\n\n4,766 lbs – Model S Plaid\n\n4,561 lbs – Model S Long Range\n\n4,416 lbs – Model Y Long Range/Performance\n\n4,065 lbs – Model 3 Long Range/Performance\n\n3,582 lbs – Model 3 Standard Range Plus\n\n2,723 lbs Gen. 1 Tesla Roadster\n\nHow much does Tesla Cybertruck weigh?\n\nUnfortunately, we do not have that granular of specs on the upcoming Tesla Cybertruck yet, although we have asked Tesla several times.\n\nBased on the increased size and payload capacity (at least 3,500 lbs) compared to the current largest Tesla in the Model X, we anticipate the weight of the three upcoming powertrains on the Cybertruck to be between 5,000 and 6,500 lbs.\n\nThat being said, towing capacities up to 14,000 lbs., like Tesla is advertising for the tri-motor Cybertruck, could very well require more weight beyond 6,500 lbs.\n\nCheck back in with our Cybertruck guide periodically for the latest specs from Tesla.\n\nHow much does the 2nd generation Tesla Roadster weigh?\n\nMuch like the Cybertruck, Tesla has not yet revealed what the second-generation Roadster will tip the scales at when it debuts in 2022.\n\nBased on its size and touted performance, complete with new motors, we'd expect the new Roadster to land somewhere near the upcoming Model S trims, perhaps between 4,400 and 4,700 lbs.\n\nWe will know for certain when Tesla shares more details of the Gen. 2 Roadster… like whether it can actually hover or not.\n\nFTC: We use income earning auto affiliate links. More.\n\nSubscribe to Electrek on YouTube for exclusive videos and subscribe to the podcast.",
                            "rights": "electrek.co",
                            "rank": 3297,
                            "topic": "news",
                            "country": "US",
                            "language": "en",
                            "authors": [
                                "Scooter Doll"
                            ],
                            "media": "https://i1.wp.com/electrek.co/wp-content/uploads/sites/3/2021/08/Tesla-on-a-scale.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
                            "is_opinion": false,
                            "twitter_account": "@electrekco",
                            "_score": 13.09692,
                            "_id": "b9a2f7cabf9255d7e9ec19c6dc65018d"
                        }
                    ],
                    "user_input": {
                        "q": "Tesla",
                        "search_in": [
                            "title",
                            "summary"
                        ],
                        "lang": null,
                        "not_lang": null,
                        "countries": null,
                        "not_countries": null,
                        "from": "2021-08-02 00:00:00",
                        "to": null,
                        "ranked_only": "True",
                        "from_rank": null,
                        "to_rank": null,
                        "sort_by": "relevancy",
                        "page": 1,
                        "size": 2,
                        "sources": null,
                        "not_sources": null,
                        "topic": null,
                        "published_date_precision": null
                    }
                }
            }
        ],
        "isMockResponseEnabled": false,
        "block_id": null,
        "gatewaySettings": null,
        "apiQueryModel": null,
        "properties": null,
        "vid": null,
        "nid": null
    },
    {
        "id": 126911,
        "executor_type": "THIRDPARTY",
        "executor_name": "getLatestHeadlines",
        "executor_version": "v2",
        "executor_display_name": "Get Latest Headlines",
        "executor_description": "Get the latest headlines given any topic, country, source or language",
        "executor_category": "LatestHeadlines",
        "executor_category_group": "LatestHeadlines",
        "service_provider": "newscatcher",
        "executor_scope": null,
        "partner": "b2b",
        "account_id": "b2b",
        "executor_method_type": "GET",
        "apiUrl": "https://api.newscatcherapi.com/v2/latest_headlines",
        "dataroot": null,
        "pathParams": [],
        "queryParams": [
            {
                "key": "ranked_only",
                "value": "",
                "description": "Default: True  Limit the search only for the sources which are in the top 1 million online websites. Unranked sources are assigned a rank that equals 999999",
                "req": false
            },
            {
                "key": "when",
                "value": "",
                "description": "The time period you want to get the latest headlines for.  Accepted forms: - 7d => Dailly Form (last 7 days time period),  30d  (last 30 days time period) - 1h => Hourly Form (last hour), 24h (last 24 hours)  Default: The number of historic data available for your subscription plan",
                "req": false
            },
            {
                "key": "lang",
                "value": "",
                "description": "Specifies the languages of the search. For example,  en .  The only accepted format is ISO 639-1 — 2 letter code.  Refer to the Allowed Languages section for more details.",
                "req": false
            },
            {
                "key": "countries",
                "value": "",
                "description": "Countries where the news publisher is located.  Important: This parameter is not responsible for the countries mentioned in the news article.  One or multiple countries can be used in the search.  The only acceptable format is ISO 3166-1 alpha-2  For example,  US,CA,MX  or just  US",
                "req": false
            },
            {
                "key": "not_countries",
                "value": "",
                "description": "The inverse of the  countries  parameter.",
                "req": false
            },
            {
                "key": "topic",
                "value": "",
                "description": "Accepted values:  news ,  sport , tech ,  world ,  finance , politics ,  business ,  economics ,  entertainment ,  beauty ,  travel ,  music ,  food ,  science ,  gaming ,  energy . The topic to which you want to restrict the articles of your choice.  Not all news articles are assigned with a topic, therefore, we cannot guarantee that 100% of topics talking about technology will be assigned a tech label.",
                "req": false
            },
            {
                "key": "sources",
                "value": "",
                "description": "One or more news resources to filter your search. It should be the normal form of the URL,  For example,  nytimes.com,theguardian.com",
                "req": false
            },
            {
                "key": "not_sources",
                "value": "",
                "description": "One or more sources to be excluded from the search.   Comma-separated list. For example,  wsj.com",
                "req": false
            },
            {
                "key": "page_size",
                "value": "",
                "description": "[1:100]  How many articles to return per page.",
                "req": false
            },
            {
                "key": "page",
                "value": "",
                "description": "The number of the page. Use it to scroll through the results.   This parameter is used to paginate: scroll through results because one API response cannot return more than 100 articles.",
                "req": false
            }
        ],
        "headers": [
            {
                "key": "x-api-key",
                "value": "",
                "description": "Your unique authentication token",
                "req": false
            }
        ],
        "authModel": {
            "authType": "api_key",
            "authAttributes": {}
        },
        "requestBody": {
            "value": "",
            "key": "payload",
            "description": "Document in JSON format",
            "annotation": "RequestBody"
        },
        "prerequisites": null,
        "executors": null,
        "functions": null,
        "responseAttributes": [
            {
                "attributeName": null,
                "displayName": null,
                "description": null,
                "type": null,
                "size": 0,
                "precision": 0,
                "autoIncrement": false,
                "defaultValue": null,
                "subType": [],
                "attributeType": "None",
                "required": false,
                "dataStoragePolicy": "None",
                "apiAccessPolicy": "None",
                "displayPolicy": "None",
                "array": false,
                "customType": false,
                "updateOption": null,
                "previousAttributeName": null,
                "compliances": null
            }
        ],
        "response": null,
        "attributeMappings": null,
        "source": null,
        "block_attributes": null,
        "workflow_credentials": null,
        "disabled": false,
        "published": true,
        "scopeOfAccess": "public",
        "registeredAsIs": true,
        "creationTime": 1712300346806,
        "lastModifiedTime": 1712300346806,
        "executionLib": null,
        "isDocumentationPublished": true,
        "mockResponses": [
            {
                "statusCode": 200,
                "name": null,
                "statusText": null,
                "methodType": "GET",
                "message": "Success",
                "description": null,
                "headers": [
                    {
                        "name": "Content-Type",
                        "value": "application/json"
                    }
                ],
                "cookies": null,
                "responseAttributes": [],
                "sampleData": {
                    "status": "ok",
                    "total_hits": 10000,
                    "page": 1,
                    "total_pages": 5000,
                    "page_size": 2,
                    "articles": [
                        {
                            "title": "ARK reduziert Anteile: Cathie Wood wirft Tesla-Aktien aus dem Depot",
                            "author": null,
                            "published_date": "2021-08-04 01:15:00",
                            "published_date_precision": "full",
                            "link": "https://www.finanzen.net/nachricht/aktien/beteiligung-reduziert-ark-reduziert-anteile-cathie-wood-wirft-tesla-aktien-aus-dem-depot-10402608",
                            "clean_url": "finanzen.net",
                            "excerpt": "• ARK Invest verkauft Tesla-Anteile im Wert von 43,7 Millionen US-Dollar • Tesla-Aktie bleibt Top-Holding in drei ETFs • Cathie Wood sieht Tesla-Aktie falsch ...",
                            "summary": "• ARK Invest verkauft Tesla-Anteile im Wert von 43,7 Millionen US-Dollar• Tesla-Aktie bleibt Top-Holding in drei ETFs• Cathie Wood sieht Tesla-Aktie falsch bewertet Die starke Entwicklung der Tesla-Aktie im Jahr 2020 war einer der Hauptwachstumstreiber in den ETFs der Investmentfirma ARK Invest. Im April hatte das Unternehmen bei einem Aktienpreis von rund 719 US-Dollar dann zuletzt einige Tesla-Aktien aus dem Depot geworfen, jetzt war es erneut soweit. Tesla-Aktien verkauft: 43,7 Millionen US-Dollar eingenommen ARK veräußerte 63.643 Tesla-Aktien und hat bei dem Verkauf 43,7 Millionen US-Dollar eingenommen, das geht aus dem Trading-Update des Unternehmens hervor. Tesla ist die Top-Holding im Flaggschiff ETF ARK Innovation und ist ebenfalls die größte Beteiligung in zwei weiteren ARK-ETFs: Dem Ark Autonomous Technology & Robotics ETF und dem Ark Next Generation Internet ETF. Insgesamt befinden sich nun noch 4.873.916 Tesla-Aktien in den ETFs von ARK Invest, der Gesamtwert des Investments belief sich zuletzt auf rund 3,3 Milliarden US-Dollar. Tesla von falschen Analysten falsch bewertet Dass der Teil-Verkauf von Tesla-Aktien den Langzeit-Bullen Wood an dem Elektroautobauer zweifeln lässt, ist allerdings nicht anzunehmen. Noch vor Veröffentlichung der Quartalsbilanz von Tesla hatte Wood in einem Interview ihr Basis-Kursziel von 3.000 US-Dollar für die Tesla-Aktie bestätigt. Gegenüber \"Real Vision\" nahm die Investorin dabei auch Tesla-Analysten ins Visier, die ihrer Meinung nach mit dafür verantwortlich sind, dass Tesla am Markt falsch bewertet wird: \"Wir glauben, dass der Grund für eine so große Ineffizienz bei Teslas Bewertung der kurzfristige Zeithorizont der Analysten ist und die Tatsache, dass die falschen Analysten folgen\". Sie betonte, dass Tesla mehrheitlich von Auto-Analysten bewertet werde, dabei sei der Konzern von Elon Musk ein \"facettenreiches Technologieunternehmen\". Bei ARK hab man eine andere Herangehensweise, um die Aktie von Tesla korrekt bewerten zu können: \"Tesla ist ein Technologieunternehmen, aber nicht nur ein Technologieunternehmen\", sagte sie und nannte in dem Zusammenhang auch Energiespeicher, Robotik, künstliche Intelligenz und Software-as-a-Service. \"Wir haben also drei Analysten, die das Tesla-Modell zusammenbauen\", erklärte sie. ARK investiert in Innovation Die Investmentgesellschaft der Starinvestorin hat sich vorrangig auf die Marktsegmente Digitalisierung und Technologie konzentriert und das Portfolio ihrer ETFs konsequent darauf ausgerichtet. Der Fokus hat dafür gesorgt, dass ARK in den vergangenen Jahren eine starke Rendite erwirtschaften konnte und im vergangenen Jahr auch Investorenlegende Warren Buffett und seiner Holding Berkshire Hathaway den Rang abgelaufen hatte.",
                            "rights": "klamm.de",
                            "rank": 7420,
                            "topic": "news",
                            "country": "unknown",
                            "language": "de",
                            "authors": [],
                            "media": "https://static.klamm.de/news/news-img-k.jpg",
                            "is_opinion": false,
                            "twitter_account": null,
                            "_score": 13.178295,
                            "_id": "e3c5e3a88c985a015b6051812198670d"
                        },
                        {
                            "title": "How much does a Tesla weigh? Comparing each model",
                            "author": "Scooter Doll",
                            "published_date": "2021-08-02 08:23:00",
                            "published_date_precision": "full",
                            "link": "https://electrek.co/2021/08/02/how-much-does-a-tesla-weigh-comparing-each-model",
                            "clean_url": "electrek.co",
                            "excerpt": "When learning more about Tesla and its growing fleet of EVs, consumers new to the market have a lot of the same questions. Inquiries such as How much does a Tesla cost? How long does it take to charge a Tesla? How much does it cost to charge a Tesla? Believe it or not, one of the most frequent questions we receive in addition to those above is, How much does a Tesla weigh? \nWhile this question is more easily answered than others, there are a few factors that play a role in the weight of each Tesla model. Here's everything you need to know broken down by model.\n more…\nThe post How much does a Tesla weigh? Comparing each model appeared first on Electrek.",
                            "summary": "When learning more about Tesla and its growing fleet of EVs, consumers new to the market have a lot of the same questions. Inquiries such as How much does a Tesla cost? How long does it take to charge a Tesla? How much does it cost to charge a Tesla? Believe it or not, one of the most frequent questions we receive in addition to those above is, How much does a Tesla weigh?\n\nWhile this question is more easily answered than others, there are a few factors that play a role in the weight of each Tesla model. Here's everything you need to know broken down by model.\n\nHow much does each Tesla weigh?\n\nUnfortunately, your Tesla does not get an annual physical where a doctor can check in on your EV's weight, and there aren't too many vehicle-sized scales easily accessible to drivers.\n\nLuckily, Tesla has provided the weights of most of its vehicles, but they're still are varying factors.\n\nAside from different model types, some Teslas can vary in weight based on their trim or powertrain. Electric motors aren't as heavy ICE engine blocks, but they do carry some weight around.\n\nThat being said, more performance means more electric motors, and more motors mean additional weight.\n\nThe size and cargo space of the Tesla itself is also a pretty obvious factor, as a Model X will certainly weigh more than a Model 3 — and pretty much any other Tesla at this point.\n\nBelow is each Tesla's weight according to the American automaker, sorted by chronological debut.\n\nTesla's original Roadster EV\n\nTesla Roadster\n\nTesla's flagship EV remains its lightest model to date. The original Tesla Roadster sits as a limited-run EV and is now a collector's item for some, so its weight has not changed in the decade it's been around.\n\nThe first-generation Roadster weighs in at 2,723 lbs.\n\nModel S\n\nThe second oldest Tesla model on our list and the longest currently in production is the Model S sedan. After seeing a refresh earlier in 2021 that will eventually bring the tri-motor Plaid powertrain to drivers, the Model S can come with some weight.\n\nThe dual-motor Long Range trim, which has now been delayed to 2022, weighs 4,561 lbs.\n\nThe tri-motor Plaid Model S will weigh in at 4,766 lbs. when it (hopefully) delivers this fall.\n\nModel X\n\nThe largest current Tesla is unsurprisingly also the heaviest to date (we're still waiting on you, Cybertruck).\n\nCurrently available in two different trims, both the Long Range and new Plaid Model X weigh more than any of their Tesla siblings.\n\nThe Model X Long Range weighs 5,185 lbs., while the Plaid Model X and its three motors will weigh 5,390 lbs. Both trims are currently scheduled to arrive in the first quarter of 2022 alongside the Long Range Model S.\n\nModel 3\n\nThe cheapest Tesla available is also one of the very lightest, no matter the powertrain you choose. The Tesla Model 3 is currently available in three trims:\n\nThe single motor Model 3 Standard Range Plus is the second-lightest Tesla ever at 3,582 lbs.\n\nThe other two dual-motor Model 3 trims, Long Range and Performance, both weigh in at 4,065 lbs.\n\nModel Y\n\nThe newest Tesla to arrive currently sits in the middle of the pack on weight, which sits on brand with its pricing and performance as well.\n\nThe Tesla Model Y is currently available in either a Long Range or Performance dual-motor trim, and each weighs 4,416 lbs.\n\nWhat is the heaviest Tesla?\n\nIf you've skimmed through to this point, you must just be looking for weights and an answer to the question above without all the jibber-jabber. We respect that, so here you go.\n\nHere are all of Tesla's current models sorted heaviest to lightest:\n\n5,390 lbs – Model X Plaid\n\n5,185 lbs – Model X Long Range\n\n4,766 lbs – Model S Plaid\n\n4,561 lbs – Model S Long Range\n\n4,416 lbs – Model Y Long Range/Performance\n\n4,065 lbs – Model 3 Long Range/Performance\n\n3,582 lbs – Model 3 Standard Range Plus\n\n2,723 lbs Gen. 1 Tesla Roadster\n\nHow much does Tesla Cybertruck weigh?\n\nUnfortunately, we do not have that granular of specs on the upcoming Tesla Cybertruck yet, although we have asked Tesla several times.\n\nBased on the increased size and payload capacity (at least 3,500 lbs) compared to the current largest Tesla in the Model X, we anticipate the weight of the three upcoming powertrains on the Cybertruck to be between 5,000 and 6,500 lbs.\n\nThat being said, towing capacities up to 14,000 lbs., like Tesla is advertising for the tri-motor Cybertruck, could very well require more weight beyond 6,500 lbs.\n\nCheck back in with our Cybertruck guide periodically for the latest specs from Tesla.\n\nHow much does the 2nd generation Tesla Roadster weigh?\n\nMuch like the Cybertruck, Tesla has not yet revealed what the second-generation Roadster will tip the scales at when it debuts in 2022.\n\nBased on its size and touted performance, complete with new motors, we'd expect the new Roadster to land somewhere near the upcoming Model S trims, perhaps between 4,400 and 4,700 lbs.\n\nWe will know for certain when Tesla shares more details of the Gen. 2 Roadster… like whether it can actually hover or not.\n\nFTC: We use income earning auto affiliate links. More.\n\nSubscribe to Electrek on YouTube for exclusive videos and subscribe to the podcast.",
                            "rights": "electrek.co",
                            "rank": 3297,
                            "topic": "news",
                            "country": "US",
                            "language": "en",
                            "authors": [
                                "Scooter Doll"
                            ],
                            "media": "https://i1.wp.com/electrek.co/wp-content/uploads/sites/3/2021/08/Tesla-on-a-scale.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
                            "is_opinion": false,
                            "twitter_account": "@electrekco",
                            "_score": 13.09692,
                            "_id": "b9a2f7cabf9255d7e9ec19c6dc65018d"
                        }
                    ],
                    "user_input": {
                        "q": "Tesla",
                        "search_in": [
                            "title",
                            "summary"
                        ],
                        "lang": null,
                        "not_lang": null,
                        "countries": null,
                        "not_countries": null,
                        "from": "2021-08-02 00:00:00",
                        "to": null,
                        "ranked_only": "True",
                        "from_rank": null,
                        "to_rank": null,
                        "sort_by": "relevancy",
                        "page": 1,
                        "size": 2,
                        "sources": null,
                        "not_sources": null,
                        "topic": null,
                        "published_date_precision": null
                    }
                }
            }
        ],
        "isMockResponseEnabled": false,
        "block_id": null,
        "gatewaySettings": null,
        "apiQueryModel": null,
        "properties": null,
        "vid": null,
        "nid": null
    },
    {
        "id": 126923,
        "executor_type": "THIRDPARTY",
        "executor_name": "searchforarticles",
        "executor_version": "v3",
        "executor_display_name": "Search for articles in our database using it's link or Newscatcher ID (_id in API response)",
        "executor_description": "You must specify either links or ids, only one at a time.",
        "executor_category": "v3SearchByLink",
        "executor_category_group": "v3SearchByLink",
        "service_provider": "newscatcher",
        "executor_scope": null,
        "partner": "b2b",
        "account_id": "b2b",
        "executor_method_type": "GET",
        "apiUrl": "https://v3-api.newscatcherapi.com/api/search_by_link",
        "dataroot": null,
        "pathParams": [],
        "queryParams": [
            {
                "key": "links",
                "value": "",
                "description": "article link or list of article links you want to search for",
                "req": false
            },
            {
                "key": "ids",
                "value": "",
                "description": "Newscatcher article id (_id in API response) or a list of artilce ids you want to search for",
                "req": false
            },
            {
                "key": "page",
                "value": "",
                "description": "The number of the page. Use it to scroll through the results.   This parameter is used to paginate: scroll through results because one API response cannot return more than 1000 articles.",
                "req": false
            },
            {
                "key": "page_size",
                "value": "",
                "description": "How many articles to return per page.",
                "req": false
            }
        ],
        "headers": [
            {
                "key": "x-api-key",
                "value": "",
                "description": "Your unique authentication token",
                "req": false
            }
        ],
        "authModel": {
            "authType": "api_key",
            "authAttributes": {}
        },
        "requestBody": {
            "value": "",
            "key": "payload",
            "description": "Document in JSON format",
            "annotation": "RequestBody"
        },
        "prerequisites": null,
        "executors": null,
        "functions": null,
        "responseAttributes": [
            {
                "attributeName": null,
                "displayName": null,
                "description": null,
                "type": null,
                "size": 0,
                "precision": 0,
                "autoIncrement": false,
                "defaultValue": null,
                "subType": [],
                "attributeType": "None",
                "required": false,
                "dataStoragePolicy": "None",
                "apiAccessPolicy": "None",
                "displayPolicy": "None",
                "array": false,
                "customType": false,
                "updateOption": null,
                "previousAttributeName": null,
                "compliances": null
            }
        ],
        "response": null,
        "attributeMappings": null,
        "source": null,
        "block_attributes": null,
        "workflow_credentials": null,
        "disabled": false,
        "published": true,
        "scopeOfAccess": "public",
        "registeredAsIs": true,
        "creationTime": 1712305024595,
        "lastModifiedTime": 1712305024595,
        "executionLib": null,
        "isDocumentationPublished": true,
        "mockResponses": [
            {
                "statusCode": 200,
                "name": null,
                "statusText": null,
                "methodType": "GET",
                "message": "Success",
                "description": null,
                "headers": [
                    {
                        "name": "Content-Type",
                        "value": "application/json"
                    }
                ],
                "cookies": null,
                "responseAttributes": [],
                "sampleData": {
                    "status": "We found 1 out of 1 articles matching your query",
                    "total_hits": 1,
                    "page": 1,
                    "total_pages": 1,
                    "page_size": 100,
                    "articles": [
                        {
                            "title": "Secure Code Warrior collaborates with Netskope to launch developer training program",
                            "author": "Kenn Anthony Mendoza",
                            "authors": [
                                "Kenn Anthony Mendoza"
                            ],
                            "journalists": [
                                "Kenn Anthony Mendoza"
                            ],
                            "published_date": "2023-12-15 01:46:41",
                            "published_date_precision": "timezone unknown",
                            "updated_date": "2023-12-15 01:46:41",
                            "updated_date_precision": "timezone unknown",
                            "parse_date": "2023-12-15 06:00:33",
                            "link": "https://itwire.com/it-people-news/education/secure-code-warrior-collaborates-with-netskope-to-launch-developer-training-program.html",
                            "domain_url": "itwire.com",
                            "full_domain_url": "itwire.com",
                            "name_source": "iTWire",
                            "is_headline": true,
                            "paid_content": false,
                            "parent_url": "https://itwire.com/it-people-news",
                            "country": "US",
                            "rights": "itwire.com",
                            "rank": 12694,
                            "media": "https://itwire.com/media/k2/items/cache/13149bc661e276de613a72d47850be6e_XS.jpg",
                            "language": "en",
                            "description": "Cybersecurity company Netskope has launched its developer training program through Secure Code Warrior's learning platform. Netskope's team sought to refine its approach to secure code education to…",
                            "content": "Secure Code Warrior chief customer officer Fatemah Beydoun Cybersecurity company Netskope has launched its developer training program through Secure Code Warrior's learning platform. Netskope's team sought to refine its approach to secure code education to keep up with its accelerated software development demands. It wanted to excite developers through more hands-on learning approaches without relying on traditional learning mechanisms that had limitations on coding languages and self-service options. One key decision was to change the name of Netskope's program internally to 'self-service adoption.' In working with Secure Code Warrior, Netskope built a program that made security content visible and accessible to developers. 'We're getting a better return on investment with our developer educational training efforts because of higher participation and the fact that these efforts no longer feel like they're a check-the-box, compliance-mandated activity,' said Netskope deputy chief information security officer James Robinson. 'The byproduct of all of this is that we're enabling our developers to be security champions.' 'Netskope is enabling developers to learn the way they want, and Secure Code Warrior is the driving force behind it. We couldn't be prouder of the outcomes,' said Secure Code Warrior chief customer officer Fatemah Beydoun. 'This is why major technology companies around the world come to Secure Code Warrior to ensure their developers can sharpen their skills with the most complete, relevant, and reliable secure coding content in the industry today.'\nSubscribe to ITWIRE UPDATE Newsletter here\nJOIN our iTWireTV our YouTube Community here\nBACK TO LATEST NEWS here You probably know that we are big believers in Network Detection and Response (NDR). Did you realise that Gartner also recommends that security teams prioritise NDR solutions to enhance their detection and response? Picking the right NDR for your team and process can sometimes be the biggest challenge. If you want to try out a Network Detection and Response tool, why not start with the best? Vectra Network Detection and Response is the industry's most advanced AI-driven attack defence for identifying and stopping malicious tactics in your network without noise or the need for decryption. Download the 2022 Gartner Market Guide for Network Detection and Response (NDR) for recommendations on how Network Detection and Response solutions can expand deeper into existing on-premises networks, and new cloud environments. DOWNLOAD NOW! PROMOTE YOUR WEBINAR ON ITWIRE It's all about Webinars. Marketing budgets are now focused on Webinars combined with Lead Generation. If you wish to promote a Webinar we recommend at least a 3 to 4 week campaign prior to your event. The iTWire campaign will include extensive adverts on our News Site itwire.com and prominent Newsletter promotion https://itwire.com/itwire-update.html and Promotional News & Editorial. Plus a video interview of the key speaker on iTWire TV https://www.youtube.com/c/iTWireTV/videos which will be used in Promotional Posts on the iTWire Home Page. Now we are coming out of Lockdown iTWire will be focussed to assisting with your webinars and campaigns and assistance via part payments and extended terms, a Webinar Business Booster Pack and other supportive programs. We can also create your adverts and written content plus coordinate your video interview. We look forward to discussing your campaign goals with you. Please click the button below. MORE INFO HERE!",
                            "highlight": null,
                            "word_count": 532,
                            "is_opinion": false,
                            "twitter_account": "@itwire",
                            "all_links": [
                                "https://www.linkedin.com/in/0xjames",
                                "https://digitalpacific.com.au/?utm_source=ITWIREFooter&utm_medium=Sponsor&utm_term=Sponsor&utm_content=ITWIREFooter&utm_campaign=ITWIREFooter",
                                "https://www.jobzilla.com.au",
                                "https://jobzilla.com.au/",
                                "https://www.facebook.com/pages/iTWirecom/144954402244675?ref=tn_tnmn",
                                "https://info.vectra.ai/gartner-market-guide-for-ndr-2022",
                                "https://statcounter.com/",
                                "https://www.linkedin.com/authwall?trk=bf&trkInfo=AQF2PVLasraVzAAAAYxrKaqwJaIMMJgwqep59ASZPz_fusEMB7SaAsvI0r-FJGPMyn_k2MOZvoTZBUeIl2tP-nsMKgIU54hjBBboLiarE50bz31ZE4zdf7SqEmQsfHkK7FghdUQ=&original_referer=https://www.google.com/&sessionRedirect=https%3A%2F%2Fau.linkedin.com%2Fin%2Ffatemah-beydoun-b6555bb1",
                                "https://www.youtube.com/c/iTWireTV/videos",
                                "https://www.youtube.com/c/iTWireTV",
                                "https://www.paxus.com.au/?utm_source=IT+Wire&utm_medium=web_page&utm_campaign=contractor",
                                "https://www.twitter.com/itwire"
                            ],
                            "all_domain_links": [
                                "youtube.com",
                                "linkedin.com",
                                "statcounter.com",
                                "jobzilla.com.au",
                                "digitalpacific.com.au",
                                "vectra.ai",
                                "paxus.com.au",
                                "facebook.com",
                                "twitter.com"
                            ],
                            "nlp": {
                                "theme": "Business, Tech",
                                "summary": "Netskope has launched its developer training program through Secure Code Warrior's learning platform. Netskope's team sought to refine its approach to secure code education to keep up with its accelerated software development demands. It wanted to excite developers through more hands-on learning approaches without relying on traditional learning mechanisms.",
                                "sentiment": {
                                    "title": 0,
                                    "content": 0.9944045543670654
                                },
                                "ner_PER": [
                                    {
                                        "entity_name": "Fatemah Beydoun",
                                        "count": 2
                                    },
                                    {
                                        "entity_name": "James Robinson",
                                        "count": 1
                                    }
                                ],
                                "ner_ORG": [
                                    {
                                        "entity_name": "Secure Code Warrior",
                                        "count": 6
                                    },
                                    {
                                        "entity_name": "Netskope",
                                        "count": 6
                                    },
                                    {
                                        "entity_name": "ITWIRE",
                                        "count": 2
                                    },
                                    {
                                        "entity_name": "itwire.com",
                                        "count": 2
                                    },
                                    {
                                        "entity_name": "adoption",
                                        "count": 1
                                    },
                                    {
                                        "entity_name": "Gartner",
                                        "count": 1
                                    },
                                    {
                                        "entity_name": "DOWNLOAD",
                                        "count": 1
                                    },
                                    {
                                        "entity_name": "iTWire",
                                        "count": 1
                                    }
                                ],
                                "ner_MISC": [
                                    {
                                        "entity_name": "Vectra Network Detection and Response",
                                        "count": 1
                                    },
                                    {
                                        "entity_name": "Gartner Market Guide",
                                        "count": 1
                                    },
                                    {
                                        "entity_name": "Detection",
                                        "count": 1
                                    }
                                ],
                                "ner_LOC": []
                            },
                            "id": "0ca5900518a9566cccae44e30c25a498",
                            "score": 13.287439
                        }
                    ],
                    "user_input": {
                        "ids": null,
                        "links": [
                            "https://itwire.com/it-people-news/education/secure-code-warrior-collaborates-with-netskope-to-launch-developer-training-program.html"
                        ],
                        "page": 1,
                        "page_size": 100
                    }
                }
            }
        ],
        "isMockResponseEnabled": false,
        "block_id": null,
        "gatewaySettings": null,
        "apiQueryModel": null,
        "properties": null,
        "vid": null,
        "nid": null
    },
    {
        "id": 126924,
        "executor_type": "THIRDPARTY",
        "executor_name": "searchforArticles",
        "executor_version": "v3",
        "executor_display_name": "Search for articles in our database using it's link or Newscatcher ID (_id in API response)",
        "executor_description": "You must specify either links or ids, only one at a time.",
        "executor_category": "v3SearchByLink",
        "executor_category_group": "v3SearchByLink",
        "service_provider": "newscatcher",
        "executor_scope": null,
        "partner": "b2b",
        "account_id": "b2b",
        "executor_method_type": "POST",
        "apiUrl": "https://v3-api.newscatcherapi.com/api/search_by_link",
        "dataroot": null,
        "pathParams": [],
        "queryParams": [
            {
                "key": "links",
                "value": "",
                "description": "article link or list of article links you want to search for",
                "req": false
            },
            {
                "key": "ids",
                "value": "",
                "description": "Newscatcher article id (_id in API response) or a list of artilce ids you want to search for",
                "req": false
            },
            {
                "key": "page",
                "value": "",
                "description": "The number of the page. Use it to scroll through the results.   This parameter is used to paginate: scroll through results because one API response cannot return more than 1000 articles.",
                "req": false
            },
            {
                "key": "page_size",
                "value": "",
                "description": "How many articles to return per page.",
                "req": false
            }
        ],
        "headers": [
            {
                "key": "x-api-key",
                "value": "",
                "description": "Your unique authentication token",
                "req": false
            },
            {
                "key": "Content-Type",
                "value": "application/json",
                "description": "",
                "req": false
            }
        ],
        "authModel": {
            "authType": "api_key",
            "authAttributes": {}
        },
        "requestBody": {
            "value": {},
            "key": "payload",
            "description": "Document in JSON format",
            "annotation": "RequestBody"
        },
        "prerequisites": null,
        "executors": null,
        "functions": null,
        "responseAttributes": [
            {
                "attributeName": null,
                "displayName": null,
                "description": null,
                "type": null,
                "size": 0,
                "precision": 0,
                "autoIncrement": false,
                "defaultValue": null,
                "subType": [],
                "attributeType": "None",
                "required": false,
                "dataStoragePolicy": "None",
                "apiAccessPolicy": "None",
                "displayPolicy": "None",
                "array": false,
                "customType": false,
                "updateOption": null,
                "previousAttributeName": null,
                "compliances": null
            }
        ],
        "response": null,
        "attributeMappings": null,
        "source": null,
        "block_attributes": null,
        "workflow_credentials": null,
        "disabled": false,
        "published": true,
        "scopeOfAccess": "public",
        "registeredAsIs": true,
        "creationTime": 1712305103384,
        "lastModifiedTime": 1712305103384,
        "executionLib": null,
        "isDocumentationPublished": true,
        "mockResponses": [
            {
                "statusCode": 200,
                "name": null,
                "statusText": null,
                "methodType": "GET",
                "message": "Success",
                "description": null,
                "headers": [
                    {
                        "name": "Content-Type",
                        "value": "application/json"
                    }
                ],
                "cookies": null,
                "responseAttributes": [],
                "sampleData": {
                    "status": "We found 1 out of 1 articles matching your query",
                    "total_hits": 1,
                    "page": 1,
                    "total_pages": 1,
                    "page_size": 100,
                    "articles": [
                        {
                            "title": "Secure Code Warrior collaborates with Netskope to launch developer training program",
                            "author": "Kenn Anthony Mendoza",
                            "authors": [
                                "Kenn Anthony Mendoza"
                            ],
                            "journalists": [
                                "Kenn Anthony Mendoza"
                            ],
                            "published_date": "2023-12-15 01:46:41",
                            "published_date_precision": "timezone unknown",
                            "updated_date": "2023-12-15 01:46:41",
                            "updated_date_precision": "timezone unknown",
                            "parse_date": "2023-12-15 06:00:33",
                            "link": "https://itwire.com/it-people-news/education/secure-code-warrior-collaborates-with-netskope-to-launch-developer-training-program.html",
                            "domain_url": "itwire.com",
                            "full_domain_url": "itwire.com",
                            "name_source": "iTWire",
                            "is_headline": true,
                            "paid_content": false,
                            "parent_url": "https://itwire.com/it-people-news",
                            "country": "US",
                            "rights": "itwire.com",
                            "rank": 12694,
                            "media": "https://itwire.com/media/k2/items/cache/13149bc661e276de613a72d47850be6e_XS.jpg",
                            "language": "en",
                            "description": "Cybersecurity company Netskope has launched its developer training program through Secure Code Warrior's learning platform. Netskope's team sought to refine its approach to secure code education to…",
                            "content": "Secure Code Warrior chief customer officer Fatemah Beydoun Cybersecurity company Netskope has launched its developer training program through Secure Code Warrior's learning platform. Netskope's team sought to refine its approach to secure code education to keep up with its accelerated software development demands. It wanted to excite developers through more hands-on learning approaches without relying on traditional learning mechanisms that had limitations on coding languages and self-service options. One key decision was to change the name of Netskope's program internally to 'self-service adoption.' In working with Secure Code Warrior, Netskope built a program that made security content visible and accessible to developers. 'We're getting a better return on investment with our developer educational training efforts because of higher participation and the fact that these efforts no longer feel like they're a check-the-box, compliance-mandated activity,' said Netskope deputy chief information security officer James Robinson. 'The byproduct of all of this is that we're enabling our developers to be security champions.' 'Netskope is enabling developers to learn the way they want, and Secure Code Warrior is the driving force behind it. We couldn't be prouder of the outcomes,' said Secure Code Warrior chief customer officer Fatemah Beydoun. 'This is why major technology companies around the world come to Secure Code Warrior to ensure their developers can sharpen their skills with the most complete, relevant, and reliable secure coding content in the industry today.'\nSubscribe to ITWIRE UPDATE Newsletter here\nJOIN our iTWireTV our YouTube Community here\nBACK TO LATEST NEWS here You probably know that we are big believers in Network Detection and Response (NDR). Did you realise that Gartner also recommends that security teams prioritise NDR solutions to enhance their detection and response? Picking the right NDR for your team and process can sometimes be the biggest challenge. If you want to try out a Network Detection and Response tool, why not start with the best? Vectra Network Detection and Response is the industry's most advanced AI-driven attack defence for identifying and stopping malicious tactics in your network without noise or the need for decryption. Download the 2022 Gartner Market Guide for Network Detection and Response (NDR) for recommendations on how Network Detection and Response solutions can expand deeper into existing on-premises networks, and new cloud environments. DOWNLOAD NOW! PROMOTE YOUR WEBINAR ON ITWIRE It's all about Webinars. Marketing budgets are now focused on Webinars combined with Lead Generation. If you wish to promote a Webinar we recommend at least a 3 to 4 week campaign prior to your event. The iTWire campaign will include extensive adverts on our News Site itwire.com and prominent Newsletter promotion https://itwire.com/itwire-update.html and Promotional News & Editorial. Plus a video interview of the key speaker on iTWire TV https://www.youtube.com/c/iTWireTV/videos which will be used in Promotional Posts on the iTWire Home Page. Now we are coming out of Lockdown iTWire will be focussed to assisting with your webinars and campaigns and assistance via part payments and extended terms, a Webinar Business Booster Pack and other supportive programs. We can also create your adverts and written content plus coordinate your video interview. We look forward to discussing your campaign goals with you. Please click the button below. MORE INFO HERE!",
                            "highlight": null,
                            "word_count": 532,
                            "is_opinion": false,
                            "twitter_account": "@itwire",
                            "all_links": [
                                "https://www.linkedin.com/in/0xjames",
                                "https://digitalpacific.com.au/?utm_source=ITWIREFooter&utm_medium=Sponsor&utm_term=Sponsor&utm_content=ITWIREFooter&utm_campaign=ITWIREFooter",
                                "https://www.jobzilla.com.au",
                                "https://jobzilla.com.au/",
                                "https://www.facebook.com/pages/iTWirecom/144954402244675?ref=tn_tnmn",
                                "https://info.vectra.ai/gartner-market-guide-for-ndr-2022",
                                "https://statcounter.com/",
                                "https://www.linkedin.com/authwall?trk=bf&trkInfo=AQF2PVLasraVzAAAAYxrKaqwJaIMMJgwqep59ASZPz_fusEMB7SaAsvI0r-FJGPMyn_k2MOZvoTZBUeIl2tP-nsMKgIU54hjBBboLiarE50bz31ZE4zdf7SqEmQsfHkK7FghdUQ=&original_referer=https://www.google.com/&sessionRedirect=https%3A%2F%2Fau.linkedin.com%2Fin%2Ffatemah-beydoun-b6555bb1",
                                "https://www.youtube.com/c/iTWireTV/videos",
                                "https://www.youtube.com/c/iTWireTV",
                                "https://www.paxus.com.au/?utm_source=IT+Wire&utm_medium=web_page&utm_campaign=contractor",
                                "https://www.twitter.com/itwire"
                            ],
                            "all_domain_links": [
                                "youtube.com",
                                "linkedin.com",
                                "statcounter.com",
                                "jobzilla.com.au",
                                "digitalpacific.com.au",
                                "vectra.ai",
                                "paxus.com.au",
                                "facebook.com",
                                "twitter.com"
                            ],
                            "nlp": {
                                "theme": "Business, Tech",
                                "summary": "Netskope has launched its developer training program through Secure Code Warrior's learning platform. Netskope's team sought to refine its approach to secure code education to keep up with its accelerated software development demands. It wanted to excite developers through more hands-on learning approaches without relying on traditional learning mechanisms.",
                                "sentiment": {
                                    "title": 0,
                                    "content": 0.9944045543670654
                                },
                                "ner_PER": [
                                    {
                                        "entity_name": "Fatemah Beydoun",
                                        "count": 2
                                    },
                                    {
                                        "entity_name": "James Robinson",
                                        "count": 1
                                    }
                                ],
                                "ner_ORG": [
                                    {
                                        "entity_name": "Secure Code Warrior",
                                        "count": 6
                                    },
                                    {
                                        "entity_name": "Netskope",
                                        "count": 6
                                    },
                                    {
                                        "entity_name": "ITWIRE",
                                        "count": 2
                                    },
                                    {
                                        "entity_name": "itwire.com",
                                        "count": 2
                                    },
                                    {
                                        "entity_name": "adoption",
                                        "count": 1
                                    },
                                    {
                                        "entity_name": "Gartner",
                                        "count": 1
                                    },
                                    {
                                        "entity_name": "DOWNLOAD",
                                        "count": 1
                                    },
                                    {
                                        "entity_name": "iTWire",
                                        "count": 1
                                    }
                                ],
                                "ner_MISC": [
                                    {
                                        "entity_name": "Vectra Network Detection and Response",
                                        "count": 1
                                    },
                                    {
                                        "entity_name": "Gartner Market Guide",
                                        "count": 1
                                    },
                                    {
                                        "entity_name": "Detection",
                                        "count": 1
                                    }
                                ],
                                "ner_LOC": []
                            },
                            "id": "0ca5900518a9566cccae44e30c25a498",
                            "score": 13.287439
                        }
                    ],
                    "user_input": {
                        "ids": null,
                        "links": [
                            "https://itwire.com/it-people-news/education/secure-code-warrior-collaborates-with-netskope-to-launch-developer-training-program.html"
                        ],
                        "page": 1,
                        "page_size": 100
                    }
                }
            }
        ],
        "isMockResponseEnabled": false,
        "block_id": null,
        "gatewaySettings": null,
        "apiQueryModel": null,
        "properties": null,
        "vid": null,
        "nid": null
    },
    {
        "id": 126914,
        "executor_type": "THIRDPARTY",
        "executor_name": "getsources",
        "executor_version": "v2",
        "executor_display_name": "Get Sources",
        "executor_description": "Get top news sources supported by NewsCatcher.",
        "executor_category": "Sources",
        "executor_category_group": "Sources",
        "service_provider": "newscatcher",
        "executor_scope": null,
        "partner": "b2b",
        "account_id": "b2b",
        "executor_method_type": "POST",
        "apiUrl": "https://api.newscatcherapi.com/v2/sources",
        "dataroot": null,
        "pathParams": [],
        "queryParams": [
            {
                "key": "lang",
                "value": "",
                "description": "Specifies the languages of the search. For example,  en .  The only accepted format is ISO 639-1 — 2 letter code.",
                "req": false
            },
            {
                "key": "countries",
                "value": "",
                "description": "Countries where the news publisher is located.  Important: This parameter is not responsible for the countries mentioned in the news article.  One or multiple countries can be used in the search.  The only acceptable format is ISO 3166-1 alpha-2  For example,  US,CA,MX  or just  US",
                "req": false
            },
            {
                "key": "topic",
                "value": "",
                "description": "Accepted values:  news ,  sport , tech ,  world ,  finance , politics ,  business ,  economics ,  entertainment ,  beauty ,  travel ,  music ,  food ,  science ,  gaming ,  energy . The topic to which you want to restrict the articles of your choice.  Not all news articles are assigned with a topic, therefore, we cannot guarantee that 100% of topics talking about technology will be assigned a tech label.",
                "req": false
            }
        ],
        "headers": [
            {
                "key": "x-api-key",
                "value": "",
                "description": "Your unique authentication token",
                "req": false
            },
            {
                "key": "Content-Type",
                "value": "application/json",
                "description": "",
                "req": false
            }
        ],
        "authModel": {
            "authType": "api_key",
            "authAttributes": {}
        },
        "requestBody": {
            "value": {},
            "key": "payload",
            "description": "Document in JSON format",
            "annotation": "RequestBody"
        },
        "prerequisites": null,
        "executors": null,
        "functions": null,
        "responseAttributes": [
            {
                "attributeName": null,
                "displayName": null,
                "description": null,
                "type": null,
                "size": 0,
                "precision": 0,
                "autoIncrement": false,
                "defaultValue": null,
                "subType": [],
                "attributeType": "None",
                "required": false,
                "dataStoragePolicy": "None",
                "apiAccessPolicy": "None",
                "displayPolicy": "None",
                "array": false,
                "customType": false,
                "updateOption": null,
                "previousAttributeName": null,
                "compliances": null
            }
        ],
        "response": null,
        "attributeMappings": null,
        "source": null,
        "block_attributes": null,
        "workflow_credentials": null,
        "disabled": false,
        "published": true,
        "scopeOfAccess": null,
        "registeredAsIs": true,
        "creationTime": 1712301232889,
        "lastModifiedTime": 1712301433042,
        "executionLib": null,
        "isDocumentationPublished": true,
        "mockResponses": [],
        "isMockResponseEnabled": false,
        "block_id": null,
        "gatewaySettings": null,
        "apiQueryModel": null,
        "properties": {
            "showBodyParamDescription": false,
            "bodyParamDescription": []
        },
        "vid": null,
        "nid": null
    },
    {
        "id": 126913,
        "executor_type": "THIRDPARTY",
        "executor_name": "getSources",
        "executor_version": "v2",
        "executor_display_name": "Get Sources",
        "executor_description": "Get top news sources supported by NewsCatcher.",
        "executor_category": "Sources",
        "executor_category_group": "Sources",
        "service_provider": "newscatcher",
        "executor_scope": null,
        "partner": "b2b",
        "account_id": "b2b",
        "executor_method_type": "GET",
        "apiUrl": "https://api.newscatcherapi.com/v2/sources",
        "dataroot": null,
        "pathParams": [],
        "queryParams": [
            {
                "key": "lang",
                "value": "",
                "description": "Specifies the languages of the search. For example,  en .  The only accepted format is ISO 639-1 — 2 letter code.",
                "req": false
            },
            {
                "key": "countries",
                "value": "",
                "description": "Countries where the news publisher is located.  Important: This parameter is not responsible for the countries mentioned in the news article.  One or multiple countries can be used in the search.  The only acceptable format is ISO 3166-1 alpha-2  For example,  US,CA,MX  or just  US",
                "req": false
            },
            {
                "key": "topic",
                "value": "",
                "description": "Accepted values:  news ,  sport , tech ,  world ,  finance , politics ,  business ,  economics ,  entertainment ,  beauty ,  travel ,  music ,  food ,  science ,  gaming ,  energy . The topic to which you want to restrict the articles of your choice.  Not all news articles are assigned with a topic, therefore, we cannot guarantee that 100% of topics talking about technology will be assigned a tech label.",
                "req": false
            }
        ],
        "headers": [
            {
                "key": "x-api-key",
                "value": "",
                "description": "Your unique authentication token",
                "req": false
            }
        ],
        "authModel": {
            "authType": "api_key",
            "authAttributes": {}
        },
        "requestBody": {
            "value": "",
            "key": "payload",
            "description": "Document in JSON format",
            "annotation": "RequestBody"
        },
        "prerequisites": null,
        "executors": null,
        "functions": null,
        "responseAttributes": [
            {
                "attributeName": null,
                "displayName": null,
                "description": null,
                "type": null,
                "size": 0,
                "precision": 0,
                "autoIncrement": false,
                "defaultValue": null,
                "subType": [],
                "attributeType": "None",
                "required": false,
                "dataStoragePolicy": "None",
                "apiAccessPolicy": "None",
                "displayPolicy": "None",
                "array": false,
                "customType": false,
                "updateOption": null,
                "previousAttributeName": null,
                "compliances": null
            }
        ],
        "response": null,
        "attributeMappings": null,
        "source": null,
        "block_attributes": null,
        "workflow_credentials": null,
        "disabled": false,
        "published": true,
        "scopeOfAccess": "public",
        "registeredAsIs": true,
        "creationTime": 1712301130233,
        "lastModifiedTime": 1712301130233,
        "executionLib": null,
        "isDocumentationPublished": true,
        "mockResponses": [
            {
                "statusCode": 200,
                "name": null,
                "statusText": null,
                "methodType": "GET",
                "message": "Success",
                "description": null,
                "headers": [
                    {
                        "name": "Content-Type",
                        "value": "application/json"
                    }
                ],
                "cookies": null,
                "responseAttributes": [],
                "sampleData": {
                    "message": "Maximum sources displayed according to your plan is set to 100",
                    "sources": [
                        "businessinsider.com",
                        "forbes.com",
                        "apnews.com",
                        "yahoo.com",
                        "newstimes.com",
                        "timesunion.com",
                        "ourmidland.com",
                        "stamfordadvocate.com",
                        "thetelegraph.com",
                        "fairfieldcitizenonline.com",
                        "newmilfordspectrum.com",
                        "nhregister.com",
                        "sfchronicle.com",
                        "sheltonherald.com",
                        "greenwichtime.com",
                        "seattlepi.com",
                        "sfgate.com",
                        "westport-news.com",
                        "myjournalcourier.com",
                        "registercitizen.com",
                        "theintelligencer.com",
                        "beaumontenterprise.com",
                        "ctpost.com",
                        "lmtonline.com",
                        "middletownpress.com",
                        "mrt.com",
                        "thehour.com",
                        "chron.com",
                        "michigansthumb.com",
                        "milfordmirror.com",
                        "mysanantonio.com",
                        "thecourierexpress.com",
                        "cnbc.com",
                        "thedailytimes.com",
                        "myplainview.com",
                        "wiltonbulletin.com",
                        "theridgefieldpress.com",
                        "bigrapidsnews.com",
                        "manisteenews.com",
                        "ncadvertiser.com",
                        "trumbulltimes.com",
                        "google.com",
                        "sandiegouniontribune.com",
                        "youtube.com",
                        "si.com",
                        "yardbarker.com",
                        "nasdaq.com",
                        "bloomberg.com",
                        "bozemandailychronicle.com",
                        "reuters.com",
                        "blackenterprise.com",
                        "seekingalpha.com",
                        "stltoday.com",
                        "cbs42.com",
                        "reddit.com",
                        "detroitnews.com",
                        "wric.com",
                        "washingtonpost.com",
                        "benzinga.com",
                        "inc.com",
                        "sacbee.com",
                        "timescolonist.com",
                        "muscatinejournal.com",
                        "businessreport.com",
                        "click2houston.com",
                        "deadline.com",
                        "ksat.com",
                        "marketscreener.com",
                        "tapinto.net",
                        "tucson.com",
                        "bradenton.com",
                        "cheatsheet.com",
                        "cnn.com",
                        "darientimes.com",
                        "nbcconnecticut.com",
                        "patch.com",
                        "tri-cityherald.com",
                        "billboard.com",
                        "businessjournaldaily.com",
                        "coindesk.com",
                        "fastcompany.com",
                        "fortune.com",
                        "foxbusiness.com",
                        "heraldonline.com",
                        "khn.org",
                        "nbcnewyork.com",
                        "news24.com",
                        "nytimes.com",
                        "techcrunch.com",
                        "thenewstribune.com",
                        "thenextweb.com",
                        "argusleader.com",
                        "bizjournals.com",
                        "brinkwire.com",
                        "cbslocal.com",
                        "kansas.com",
                        "looper.com",
                        "news4jax.com",
                        "republicworld.com",
                        "americanbankingnews.com"
                    ],
                    "user_input": {
                        "lang": [
                            "en"
                        ],
                        "countries": [
                            "US"
                        ],
                        "topic": "business"
                    }
                }
            }
        ],
        "isMockResponseEnabled": false,
        "block_id": null,
        "gatewaySettings": null,
        "apiQueryModel": null,
        "properties": null,
        "vid": null,
        "nid": null
    },
    {
        "id": 126920,
        "executor_type": "THIRDPARTY",
        "executor_name": "getthelistofsourcesinourDatabase",
        "executor_version": "v3",
        "executor_display_name": "Get the list of sources in our database",
        "executor_description": "You must specify at least one of lang, countries, predefined_sources, source_name, or source_url.  ",
        "executor_category": "v3Sources",
        "executor_category_group": "v3Sources",
        "service_provider": "newscatcher",
        "executor_scope": null,
        "partner": "b2b",
        "account_id": "b2b",
        "executor_method_type": "POST",
        "apiUrl": "https://v3-api.newscatcherapi.com/api/sources",
        "dataroot": null,
        "pathParams": [],
        "queryParams": [
            {
                "key": "lang",
                "value": "",
                "description": "Language(s) that the news outlet publishes in",
                "req": false
            },
            {
                "key": "countries",
                "value": "",
                "description": "Country of the news publication",
                "req": false
            },
            {
                "key": "predefined_sources",
                "value": "",
                "description": "Get the lists behind out TOP predefined sources per country.  The format should be strictly like this:   - starting with word top   - put the number of desired sources top source   - 2 letter country code ISO 3166-1 alpha-2  For example:  top 100 US  top 33 AT  top 5 GB  It is also possible to put multiple countries with custom number of top sources, should be comma separated.  For example:  top 100 US, GB  top 33 AT, 55 IT",
                "req": false
            },
            {
                "key": "include_additional_info",
                "value": "",
                "description": "When set to True, you get the following additional datapoints about each news source: -  nb_articles_for_7d : number of articles published by the source in the last week. - country: it's country of the origin - rank: SEO rank",
                "req": false
            },
            {
                "key": "from_rank",
                "value": "",
                "description": "[0:999999]  The lowest boundary of the rank of a news website to filter by.   Important: lower rank means that a source is more popular",
                "req": false
            },
            {
                "key": "to_rank",
                "value": "",
                "description": "[0:999999]  The highest boundary of the rank of a news website to filter by.",
                "req": false
            },
            {
                "key": "source_name",
                "value": "",
                "description": "search using the name of the news publication.   This parameter does not exact matching, so searching for 'sport' will return all sources with sport in their name like: 'Motorsport', 'Dot Esport', 'Tuttosport', etc",
                "req": false
            },
            {
                "key": "source_url",
                "value": "",
                "description": "search using the domain of the news publication   You can not use the source_url parameter in combination with any other parameter",
                "req": false
            }
        ],
        "headers": [
            {
                "key": "x-api-key",
                "value": "",
                "description": "Your unique authentication token",
                "req": false
            },
            {
                "key": "Content-Type",
                "value": "application/json",
                "description": "",
                "req": false
            }
        ],
        "authModel": {
            "authType": "api_key",
            "authAttributes": {}
        },
        "requestBody": {
            "value": {},
            "key": "payload",
            "description": "Document in JSON format",
            "annotation": "RequestBody"
        },
        "prerequisites": null,
        "executors": null,
        "functions": null,
        "responseAttributes": [
            {
                "attributeName": null,
                "displayName": null,
                "description": null,
                "type": null,
                "size": 0,
                "precision": 0,
                "autoIncrement": false,
                "defaultValue": null,
                "subType": [],
                "attributeType": "None",
                "required": false,
                "dataStoragePolicy": "None",
                "apiAccessPolicy": "None",
                "displayPolicy": "None",
                "array": false,
                "customType": false,
                "updateOption": null,
                "previousAttributeName": null,
                "compliances": null
            }
        ],
        "response": null,
        "attributeMappings": null,
        "source": null,
        "block_attributes": null,
        "workflow_credentials": null,
        "disabled": false,
        "published": true,
        "scopeOfAccess": "public",
        "registeredAsIs": true,
        "creationTime": 1712304352840,
        "lastModifiedTime": 1712304352840,
        "executionLib": null,
        "isDocumentationPublished": true,
        "mockResponses": [
            {
                "statusCode": 200,
                "name": null,
                "statusText": null,
                "methodType": "GET",
                "message": "Success",
                "description": null,
                "headers": [
                    {
                        "name": "Content-Type",
                        "value": "application/json"
                    }
                ],
                "cookies": null,
                "responseAttributes": [],
                "sampleData": {
                    "message": "Maximum sources displayed according to your plan is set to 1000",
                    "sources": [
                        {
                            "name_source": "Yahoo",
                            "domain_url": "yahoo.com",
                            "logo": null,
                            "additional_info": {
                                "nb_articles_for_7d": 49838,
                                "country": "US",
                                "rank": 31
                            }
                        },
                        {
                            "name_source": "Daily Political",
                            "domain_url": "dailypolitical.com",
                            "logo": null,
                            "additional_info": {
                                "nb_articles_for_7d": 12330,
                                "country": "US",
                                "rank": 793836
                            }
                        }
                    ]
                }
            }
        ],
        "isMockResponseEnabled": false,
        "block_id": null,
        "gatewaySettings": null,
        "apiQueryModel": null,
        "properties": null,
        "vid": null,
        "nid": null
    },
    {
        "id": 126919,
        "executor_type": "THIRDPARTY",
        "executor_name": "getthelistofsourcesinourdatabase",
        "executor_version": "v3",
        "executor_display_name": "Get the list of sources in our database",
        "executor_description": "You must specify at least one of lang, countries, predefined_sources, source_name, or source_url.  ",
        "executor_category": "v3Sources",
        "executor_category_group": "v3Sources",
        "service_provider": "newscatcher",
        "executor_scope": null,
        "partner": "b2b",
        "account_id": "b2b",
        "executor_method_type": "GET",
        "apiUrl": "https://v3-api.newscatcherapi.com/api/sources",
        "dataroot": null,
        "pathParams": [],
        "queryParams": [
            {
                "key": "lang",
                "value": "",
                "description": "Language(s) that the news outlet publishes in",
                "req": false
            },
            {
                "key": "countries",
                "value": "",
                "description": "Country of the news publication",
                "req": false
            },
            {
                "key": "predefined_sources",
                "value": "",
                "description": "Get the lists behind out TOP predefined sources per country.  The format should be strictly like this:   - starting with word top   - put the number of desired sources top source   - 2 letter country code ISO 3166-1 alpha-2  For example:  top 100 US  top 33 AT  top 5 GB  It is also possible to put multiple countries with custom number of top sources, should be comma separated.  For example:  top 100 US, GB  top 33 AT, 55 IT",
                "req": false
            },
            {
                "key": "include_additional_info",
                "value": "",
                "description": "When set to True, you get the following additional datapoints about each news source: -  nb_articles_for_7d : number of articles published by the source in the last week. - country: it's country of the origin - rank: SEO rank",
                "req": false
            },
            {
                "key": "from_rank",
                "value": "",
                "description": "[0:999999]  The lowest boundary of the rank of a news website to filter by.   Important: lower rank means that a source is more popular",
                "req": false
            },
            {
                "key": "to_rank",
                "value": "",
                "description": "[0:999999]  The highest boundary of the rank of a news website to filter by.",
                "req": false
            },
            {
                "key": "source_name",
                "value": "",
                "description": "search using the name of the news publication.   This parameter does not exact matching, so searching for 'sport' will return all sources with sport in their name like: 'Motorsport', 'Dot Esport', 'Tuttosport', etc",
                "req": false
            },
            {
                "key": "source_url",
                "value": "",
                "description": "search using the domain of the news publication   You can not use the source_url parameter in combination with any other parameter",
                "req": false
            }
        ],
        "headers": [
            {
                "key": "x-api-key",
                "value": "",
                "description": "Your unique authentication token",
                "req": false
            }
        ],
        "authModel": {
            "authType": "api_key",
            "authAttributes": {}
        },
        "requestBody": {
            "value": "",
            "key": "payload",
            "description": "Document in JSON format",
            "annotation": "RequestBody"
        },
        "prerequisites": null,
        "executors": null,
        "functions": null,
        "responseAttributes": [
            {
                "attributeName": null,
                "displayName": null,
                "description": null,
                "type": null,
                "size": 0,
                "precision": 0,
                "autoIncrement": false,
                "defaultValue": null,
                "subType": [],
                "attributeType": "None",
                "required": false,
                "dataStoragePolicy": "None",
                "apiAccessPolicy": "None",
                "displayPolicy": "None",
                "array": false,
                "customType": false,
                "updateOption": null,
                "previousAttributeName": null,
                "compliances": null
            }
        ],
        "response": null,
        "attributeMappings": null,
        "source": null,
        "block_attributes": null,
        "workflow_credentials": null,
        "disabled": false,
        "published": true,
        "scopeOfAccess": "public",
        "registeredAsIs": true,
        "creationTime": 1712304195425,
        "lastModifiedTime": 1712304195425,
        "executionLib": null,
        "isDocumentationPublished": true,
        "mockResponses": [
            {
                "statusCode": 200,
                "name": null,
                "statusText": null,
                "methodType": "GET",
                "message": "Success",
                "description": null,
                "headers": [
                    {
                        "name": "Content-Type",
                        "value": "application/json"
                    }
                ],
                "cookies": null,
                "responseAttributes": [],
                "sampleData": {
                    "message": "Maximum sources displayed according to your plan is set to 1000",
                    "sources": [
                        {
                            "name_source": "Yahoo",
                            "domain_url": "yahoo.com",
                            "logo": null,
                            "additional_info": {
                                "nb_articles_for_7d": 49838,
                                "country": "US",
                                "rank": 31
                            }
                        },
                        {
                            "name_source": "Daily Political",
                            "domain_url": "dailypolitical.com",
                            "logo": null,
                            "additional_info": {
                                "nb_articles_for_7d": 12330,
                                "country": "US",
                                "rank": 793836
                            }
                        }
                    ]
                }
            }
        ],
        "isMockResponseEnabled": false,
        "block_id": null,
        "gatewaySettings": null,
        "apiQueryModel": null,
        "properties": null,
        "vid": null,
        "nid": null
    },
    {
        "id": 126917,
        "executor_type": "THIRDPARTY",
        "executor_name": "getLatestHeadlines",
        "executor_version": "v3",
        "executor_display_name": "Get Latest Headlines",
        "executor_description": "Get the latest headlines given any topic, country, source, or language",
        "executor_category": "v3LatestHeadlines",
        "executor_category_group": "v3LatestHeadlines",
        "service_provider": "newscatcher",
        "executor_scope": null,
        "partner": "b2b",
        "account_id": "b2b",
        "executor_method_type": "GET",
        "apiUrl": "https://v3-api.newscatcherapi.com/api/latest_headlines",
        "dataroot": null,
        "pathParams": [],
        "queryParams": [
            {
                "key": "when",
                "value": "",
                "description": "",
                "req": false
            },
            {
                "key": "by_parse_date",
                "value": "",
                "description": ""
            },
            {
                "key": "page_size",
                "value": "",
                "description": ""
            }
        ],
        "headers": [
            {
                "key": "x-api-key",
                "value": "",
                "description": "Your unique authentication token",
                "req": false
            }
        ],
        "authModel": {
            "authType": "api_key",
            "authAttributes": {}
        },
        "requestBody": {
            "value": "",
            "key": "payload",
            "description": "Document in JSON format",
            "annotation": "RequestBody"
        },
        "prerequisites": null,
        "executors": null,
        "functions": null,
        "responseAttributes": [
            {
                "attributeName": null,
                "displayName": null,
                "description": null,
                "type": null,
                "size": 0,
                "precision": 0,
                "autoIncrement": false,
                "defaultValue": null,
                "subType": [],
                "attributeType": "None",
                "required": false,
                "dataStoragePolicy": "None",
                "apiAccessPolicy": "None",
                "displayPolicy": "None",
                "array": false,
                "customType": false,
                "updateOption": null,
                "previousAttributeName": null,
                "compliances": null
            }
        ],
        "response": null,
        "attributeMappings": null,
        "source": null,
        "block_attributes": null,
        "workflow_credentials": null,
        "disabled": false,
        "published": true,
        "scopeOfAccess": "public",
        "registeredAsIs": true,
        "creationTime": 1712303658418,
        "lastModifiedTime": 1712303658418,
        "executionLib": null,
        "isDocumentationPublished": true,
        "mockResponses": [
            {
                "statusCode": 200,
                "name": null,
                "statusText": null,
                "methodType": "GET",
                "message": "Success",
                "description": null,
                "headers": [
                    {
                        "name": "Content-Type",
                        "value": "application/json"
                    }
                ],
                "cookies": null,
                "responseAttributes": [],
                "sampleData": {
                    "message": "Maximum sources displayed according to your plan is set to 100",
                    "sources": [
                        "businessinsider.com",
                        "forbes.com",
                        "apnews.com",
                        "yahoo.com",
                        "newstimes.com",
                        "timesunion.com",
                        "ourmidland.com",
                        "stamfordadvocate.com",
                        "thetelegraph.com",
                        "fairfieldcitizenonline.com",
                        "newmilfordspectrum.com",
                        "nhregister.com",
                        "sfchronicle.com",
                        "sheltonherald.com",
                        "greenwichtime.com",
                        "seattlepi.com",
                        "sfgate.com",
                        "westport-news.com",
                        "myjournalcourier.com",
                        "registercitizen.com",
                        "theintelligencer.com",
                        "beaumontenterprise.com",
                        "ctpost.com",
                        "lmtonline.com",
                        "middletownpress.com",
                        "mrt.com",
                        "thehour.com",
                        "chron.com",
                        "michigansthumb.com",
                        "milfordmirror.com",
                        "mysanantonio.com",
                        "thecourierexpress.com",
                        "cnbc.com",
                        "thedailytimes.com",
                        "myplainview.com",
                        "wiltonbulletin.com",
                        "theridgefieldpress.com",
                        "bigrapidsnews.com",
                        "manisteenews.com",
                        "ncadvertiser.com",
                        "trumbulltimes.com",
                        "google.com",
                        "sandiegouniontribune.com",
                        "youtube.com",
                        "si.com",
                        "yardbarker.com",
                        "nasdaq.com",
                        "bloomberg.com",
                        "bozemandailychronicle.com",
                        "reuters.com",
                        "blackenterprise.com",
                        "seekingalpha.com",
                        "stltoday.com",
                        "cbs42.com",
                        "reddit.com",
                        "detroitnews.com",
                        "wric.com",
                        "washingtonpost.com",
                        "benzinga.com",
                        "inc.com",
                        "sacbee.com",
                        "timescolonist.com",
                        "muscatinejournal.com",
                        "businessreport.com",
                        "click2houston.com",
                        "deadline.com",
                        "ksat.com",
                        "marketscreener.com",
                        "tapinto.net",
                        "tucson.com",
                        "bradenton.com",
                        "cheatsheet.com",
                        "cnn.com",
                        "darientimes.com",
                        "nbcconnecticut.com",
                        "patch.com",
                        "tri-cityherald.com",
                        "billboard.com",
                        "businessjournaldaily.com",
                        "coindesk.com",
                        "fastcompany.com",
                        "fortune.com",
                        "foxbusiness.com",
                        "heraldonline.com",
                        "khn.org",
                        "nbcnewyork.com",
                        "news24.com",
                        "nytimes.com",
                        "techcrunch.com",
                        "thenewstribune.com",
                        "thenextweb.com",
                        "argusleader.com",
                        "bizjournals.com",
                        "brinkwire.com",
                        "cbslocal.com",
                        "kansas.com",
                        "looper.com",
                        "news4jax.com",
                        "republicworld.com",
                        "americanbankingnews.com"
                    ],
                    "user_input": {
                        "lang": [
                            "en"
                        ],
                        "countries": [
                            "US"
                        ],
                        "topic": "business"
                    }
                }
            }
        ],
        "isMockResponseEnabled": false,
        "block_id": null,
        "gatewaySettings": null,
        "apiQueryModel": null,
        "properties": null,
        "vid": null,
        "nid": null
    },
    {
        "id": 126918,
        "executor_type": "THIRDPARTY",
        "executor_name": "getlatestHeadlines",
        "executor_version": "v3",
        "executor_display_name": "Get Latest Headlines",
        "executor_description": "Get the latest headlines given any topic, country, source, or language",
        "executor_category": "v3LatestHeadlines",
        "executor_category_group": "v3LatestHeadlines",
        "service_provider": "newscatcher",
        "executor_scope": null,
        "partner": "b2b",
        "account_id": "b2b",
        "executor_method_type": "POST",
        "apiUrl": "https://v3-api.newscatcherapi.com/api/latest_headlines",
        "dataroot": null,
        "pathParams": [],
        "queryParams": [
            {
                "key": "when",
                "value": "",
                "description": "",
                "req": false
            },
            {
                "key": "by_parse_date",
                "value": "",
                "description": ""
            },
            {
                "key": "page_size",
                "value": "",
                "description": ""
            }
        ],
        "headers": [
            {
                "key": "x-api-key",
                "value": "",
                "description": "Your unique authentication token",
                "req": false
            },
            {
                "key": "Content-Type",
                "value": "application/json",
                "description": "",
                "req": false
            }
        ],
        "authModel": {
            "authType": "api_key",
            "authAttributes": {}
        },
        "requestBody": null,
        "prerequisites": null,
        "executors": null,
        "functions": null,
        "responseAttributes": [
            {
                "attributeName": null,
                "displayName": null,
                "description": null,
                "type": null,
                "size": 0,
                "precision": 0,
                "autoIncrement": false,
                "defaultValue": null,
                "subType": [],
                "attributeType": "None",
                "required": false,
                "dataStoragePolicy": "None",
                "apiAccessPolicy": "None",
                "displayPolicy": "None",
                "array": false,
                "customType": false,
                "updateOption": null,
                "previousAttributeName": null,
                "compliances": null
            }
        ],
        "response": null,
        "attributeMappings": null,
        "source": null,
        "block_attributes": null,
        "workflow_credentials": null,
        "disabled": false,
        "published": true,
        "scopeOfAccess": "public",
        "registeredAsIs": true,
        "creationTime": 1712303759150,
        "lastModifiedTime": 1712303759150,
        "executionLib": null,
        "isDocumentationPublished": true,
        "mockResponses": [
            {
                "statusCode": 200,
                "name": null,
                "statusText": null,
                "methodType": "GET",
                "message": "Success",
                "description": null,
                "headers": [
                    {
                        "name": "Content-Type",
                        "value": "application/json"
                    }
                ],
                "cookies": null,
                "responseAttributes": [],
                "sampleData": {
                    "message": "Maximum sources displayed according to your plan is set to 100",
                    "sources": [
                        "businessinsider.com",
                        "forbes.com",
                        "apnews.com",
                        "yahoo.com",
                        "newstimes.com",
                        "timesunion.com",
                        "ourmidland.com",
                        "stamfordadvocate.com",
                        "thetelegraph.com",
                        "fairfieldcitizenonline.com",
                        "newmilfordspectrum.com",
                        "nhregister.com",
                        "sfchronicle.com",
                        "sheltonherald.com",
                        "greenwichtime.com",
                        "seattlepi.com",
                        "sfgate.com",
                        "westport-news.com",
                        "myjournalcourier.com",
                        "registercitizen.com",
                        "theintelligencer.com",
                        "beaumontenterprise.com",
                        "ctpost.com",
                        "lmtonline.com",
                        "middletownpress.com",
                        "mrt.com",
                        "thehour.com",
                        "chron.com",
                        "michigansthumb.com",
                        "milfordmirror.com",
                        "mysanantonio.com",
                        "thecourierexpress.com",
                        "cnbc.com",
                        "thedailytimes.com",
                        "myplainview.com",
                        "wiltonbulletin.com",
                        "theridgefieldpress.com",
                        "bigrapidsnews.com",
                        "manisteenews.com",
                        "ncadvertiser.com",
                        "trumbulltimes.com",
                        "google.com",
                        "sandiegouniontribune.com",
                        "youtube.com",
                        "si.com",
                        "yardbarker.com",
                        "nasdaq.com",
                        "bloomberg.com",
                        "bozemandailychronicle.com",
                        "reuters.com",
                        "blackenterprise.com",
                        "seekingalpha.com",
                        "stltoday.com",
                        "cbs42.com",
                        "reddit.com",
                        "detroitnews.com",
                        "wric.com",
                        "washingtonpost.com",
                        "benzinga.com",
                        "inc.com",
                        "sacbee.com",
                        "timescolonist.com",
                        "muscatinejournal.com",
                        "businessreport.com",
                        "click2houston.com",
                        "deadline.com",
                        "ksat.com",
                        "marketscreener.com",
                        "tapinto.net",
                        "tucson.com",
                        "bradenton.com",
                        "cheatsheet.com",
                        "cnn.com",
                        "darientimes.com",
                        "nbcconnecticut.com",
                        "patch.com",
                        "tri-cityherald.com",
                        "billboard.com",
                        "businessjournaldaily.com",
                        "coindesk.com",
                        "fastcompany.com",
                        "fortune.com",
                        "foxbusiness.com",
                        "heraldonline.com",
                        "khn.org",
                        "nbcnewyork.com",
                        "news24.com",
                        "nytimes.com",
                        "techcrunch.com",
                        "thenewstribune.com",
                        "thenextweb.com",
                        "argusleader.com",
                        "bizjournals.com",
                        "brinkwire.com",
                        "cbslocal.com",
                        "kansas.com",
                        "looper.com",
                        "news4jax.com",
                        "republicworld.com",
                        "americanbankingnews.com"
                    ],
                    "user_input": {
                        "lang": [
                            "en"
                        ],
                        "countries": [
                            "US"
                        ],
                        "topic": "business"
                    }
                }
            }
        ],
        "isMockResponseEnabled": false,
        "block_id": null,
        "gatewaySettings": null,
        "apiQueryModel": null,
        "properties": null,
        "vid": null,
        "nid": null
    }
]