{
    "producer": "Terraform",
    "title": "Terraform",
    "description": "Terraform is an open-source infrastructure-as-code (IaC) tool developed by HashiCorp that allows developers to define and manage cloud infrastructure resources in a declarative manner. It enables you to create, modify and delete infrastructure resources such as virtual machines, storage accounts, networking components, and more, in a version-controlled and reproducible way.  With Terraform, infrastructure is defined in code using a domain-specific language (DSL) called HashiCorp Configuration Language (HCL) or optionally, JSON. Terraform's code configuration files are called \"Terraform configurations,\" and they define the desired state of your infrastructure. You can also use Terraform to provision and manage infrastructure resources across multiple cloud providers, including Amazon Web Services (AWS), Google Cloud Platform (GCP), and Microsoft Azure.  Terraform operates on a simple principle of comparing the current state of the infrastructure with the desired state, and makes the necessary changes to bring the actual state of the infrastructure in line with the desired state. It uses a graph-based dependency model to determine the order in which resources should be created, updated, or destroyed. This makes it easy to manage complex cloud infrastructures with dependencies and ensures that resources are created or destroyed in the correct order.  Overall, Terraform provides an efficient and consistent way to automate and manage cloud infrastructure resources, making it a valuable tool for DevOps teams and cloud engineers.",
    "image": "https://s3.amazonaws.com/services.apiplatform.io/service-providers/Service%20providers%20-%20resized%20logo's/Resized%20Logo's/Terraform.png",
    "url": "https://www.terraform.io/",
    "authorization": [
        {
            "authtype": "Bearer Token",
            "authattributes": [
                {
                    "key": "token",
                    "displayname": "Token"
                }
            ]
        }
    ],
    "partner": "services",
    "account": "services",
    "isPromoted": false,
    "id": 348
}